AlanYANG0916/RCTSV0.2.1/STC1/MainUI.cpp
// MainUI.cpp : 实现文件
//

#include "stdafx.h"
#include "STC1.h"
#include "MainUI.h"
#include "afxdialogex.h"
#include "DOFComm.h"
#include "math.h"
#include "mmsystem.h"
#include<ATLBASE.H>
#include<iomanip>
#include <io.h>

#include "winsock.h"    
#include "mysql.h"  

#include <hpdf.h>
#pragma comment(lib,"libhpdf.lib")//附加依赖项，也可以在工程属性中设置

#include <websocket.h>
#include <stdio.h>

#pragma comment(lib,"libmysql.lib")//附加依赖项，也可以在工程属性中设置

//using namespace MSSOAPLib;
//using namespace MSSOAPLib


MatrxData m_m;
float ref[6];
double ForZAxisCorr[6];
double TTS_coordinate_value[7];
int IfMoveInPlace[6];//是否运动到位的标志

CString  PID;
BOOL PisOpen;//计划打开的标志位
extern int ChairMode;
extern bool REset;//先从负角度转到5.再回零的操作标志位
extern CString UserName;
extern CString permission;
extern float single_move_speed_show[6];

extern double M_COORD[6];
extern int DoingTreatMoving;

bool IsTreatMoving ;
double correctdatafor360[6];//用于360平台的校正
double ALLcorrectdatafor360[36][4];//用于360平台的校正
double sssForZAxisCorr[6];

int TwoBasicMove;
//int BeamNum;
//CString BeamName[20];//束流名称
//CString BeamTime[20];//束流应用时间
//CString BeamOper[20];//束流操作员
//double PlanBeamInfo[20][6];//束流位置的信息
//double ReBeamInfo[20][6];//真实位置的信息

Translation translation;
TreatReportData m_report;
CorrectData m_pv;
COLORREF ShowColor;

// CMainUI 对话框

IMPLEMENT_DYNAMIC(CMainUI, CDialogEx)

CMainUI::CMainUI(CWnd* pParent /*=NULL*/)
	: CDialogEx(CMainUI::IDD, pParent)
{
	trans.init();

	//m_Svr.SetDlg(this);
	////pNewConn.SetDlg(this);
	//OnBtnStart();
	//SENDTOADcount = 0;
	//m_hAccel = ::LoadAccelerators(AfxGetInstanceHandle(), MAKEINTRESOURCE(IDR_ACCELERATOR1));
	//hAccTable = LoadAccelerators(AfxGetInstanceHandle(), MAKEINTRESOURCE(IDR_ACCELERATOR1));
	//::RegisterHotKey(GetSafeHwnd(), 1000, MOD_ALT, 'D');//注册热键alt+D（D必须大写） 
	EStop = false;
	lockflag2 = false;
	PID=L"Patient ID";

	for (size_t i = 0; i < 6; i++)
	{
		TTS_coordinate_value[i] = 0;
		ref[i] = 0;	
	}
	for (size_t i = 0; i < 6; i++)
	{
		ForZAxisCorr[i] = 0;
	}
	TTS_coordinate_value[2] = 270;

	//OnBnClickedButton11();
	ReadConfig();
	ShowColor = RGB(0,255,0);
	isfirstshowbeam = true;
}

CMainUI::~CMainUI()
{
}

void CMainUI::DoDataExchange(CDataExchange* pDX)
{
	CDialogEx::DoDataExchange(pDX);

	/*DDX_Text(pDX, IDC_XEDIT2, TTS_coordinate_value[0]);
	DDX_Text(pDX, IDC_YEDIT2, TTS_coordinate_value[1]);
	DDX_Text(pDX, IDC_ZEDIT2, TTS_coordinate_value[2]);
	DDX_Text(pDX, IDC_AXEDIT2, TTS_coordinate_value[3]);
	DDX_Text(pDX, IDC_AYEDIT2, TTS_coordinate_value[4]);
	DDX_Text(pDX, IDC_AZEDIT2, TTS_coordinate_value[5]);*/

	DDX_Text(pDX, IDC_patientIDEDIT, PID);


	//DDX_Control(pDX, IDC_TREATMODEBUTTON, m_treatmentmode);

	DDX_Control(pDX, IDC_COMMLIST, m_beamlist);
	DDX_Control(pDX, IDC_PLANCOMBO, m_plancombobox);
	DDX_Control(pDX, IDC_patientIDEDIT, m_patientidedit);
	DDX_Control(pDX, IDC_workflowSTATIC, m_tr_wf_box);
}


BEGIN_MESSAGE_MAP(CMainUI, CDialogEx)
	
	
	ON_BN_CLICKED(IDC_ALIGNERBUTTON, &CMainUI::OnBnClickedAlignerbutton)

ON_WM_TIMER()
//ON_MESSAGE(WM_HOTKEY, OnHotKey)
//ON_WM_DESTROY()
ON_BN_CLICKED(IDC_TREATMODEBUTTON, &CMainUI::OnBnClickedTreatmodebutton)

ON_BN_CLICKED(IDC_CORRBUTTON, &CMainUI::OnBnClickedCorrbutton)
ON_BN_CLICKED(IDC_TREATFINISHBUTTON, &CMainUI::OnBnClickedTreatfinishbutton)
ON_BN_CLICKED(IDC_UPBUTTON, &CMainUI::OnBnClickedUpbutton)
ON_BN_CLICKED(IDC_DOWNBUTTON, &CMainUI::OnBnClickedDownbutton)

ON_EN_SETFOCUS(IDC_patientIDEDIT, &CMainUI::OnEnSetfocuspatientidedit)
ON_EN_KILLFOCUS(IDC_patientIDEDIT, &CMainUI::OnEnKillfocuspatientidedit)
//ON_COMMAND(ID_SaveReport, &CMainUI::OnSavereport)
ON_WM_CTLCOLOR()
ON_STN_CLICKED(IDC_PLANChoice, &CMainUI::OnStnClickedPlanchoice)
ON_NOTIFY(NM_DBLCLK, IDC_COMMLIST, &CMainUI::OnNMDblclkCommlist)
ON_CBN_SELCHANGE(IDC_PLANCOMBO, &CMainUI::OnCbnSelchangePlancombo)
ON_BN_CLICKED(IDC_BUTTON1, &CMainUI::OnBnClickedButton1)
ON_STN_CLICKED(IDC_STATICPExit, &CMainUI::OnStnClickedStaticpexit)
ON_NOTIFY(NM_CUSTOMDRAW, IDC_COMMLIST, &CMainUI::OnNMCustomdrawCommlist)
ON_BN_CLICKED(IDC_BUTTON3, &CMainUI::OnBnClickedButton3)
END_MESSAGE_MAP()


// CMainUI 消息处理程序


/////////////////回调函数/////////////////


//void CMainUI::OnRcv(CClientSock* pConn)
//{
//	if (NULL != pConn)
//	{
//		//char rcvBuf[513] = { 0 };
//		int nRcved = 0;
//		nRcved = pConn->Receive(&fddd, 512);
//		switch (fddd.AD1)
//		{
//		case 1:
//			OnBnClickedEnbutton();
//			break;
//		case 2:
//			OnBnClickedLockbutton();
//			break;
//		case 3:
//			OnBnClickedButton6();
//			break;
//		case 4:
//			OnBnClickedButton9();
//			break;
//		case 5:
//			OnBnClickedResetbutton();
//			break;
//		case 6:
//			OnBnClickedButton10();
//			break;
//		case 7:
//			//pConn->Send(&dddd, 32);
//			//SetDlgItemText(IDC_INFOEDIT, L"7");
//			for (size_t i = 0; i < 6; i++)
//			{
//				attitude.mid[i] = fddd.ADstate[i];
//				UpdateData(FALSE);
//				OnBnClickedCtrlbutton();
//			}
//			break;
//		case 0:
//			pConn->Send(&dddd, 32);
//			SetDlgItemText(IDC_INFOEDIT, L"0");
//			break;
//		}
//		//fddd = rcvBuf;
//		//if (SOCKET_ERROR != nRcved)
//		//{
//			//pConn->Send(&fddd, 32);
//		//}
//	}
//}
//
////有客户端断开
//void CMainUI::OnClientClose(int nErrCode, CClientSock* pConn)
//{
//	IsPhoneLink = FALSE;
//	m_infoedit.ReplaceSel(_T("\r\n手机断开"));
//	//SetDlgItemText(IDC_INFOEDIT, L"手机断开");
//	//pNewConn= nullptr;
//}
//
////有新连接
//void CMainUI::OnAccept(int nErrCode)
//{
//	if (0 == nErrCode)
//	{
//		//CClientSock* pNewConn = new CClientSock;
//		pNewConn->SetDlg(this);
//		m_Svr.Accept(*pNewConn);
//		IsPhoneLink = TRUE;
//		m_infoedit.ReplaceSel(_T("\r\n手机联入"));
//		//SetDlgItemText(IDC_INFOEDIT, L"手机联入");
//	}
//	else
//	{
//	}
//}
//
//void CMainUI::OnBtnStart()
//{
//
//	if (!m_Svr.Create(8080U, SOCK_STREAM, FD_READ | FD_WRITE | FD_OOB | FD_ACCEPT | FD_CONNECT | FD_CLOSE))
//	{
//		MessageBox(L"Create Socket Error!");
//		return;
//	}
//	if (!m_Svr.Listen())
//	{
//		int nErrorCode = m_Svr.GetLastError();
//		if (nErrorCode != WSAEWOULDBLOCK)
//		{
//			MessageBox(L"Listen Error!");
//			m_Svr.Close();
//			PostQuitMessage(0);
//			return;
//		}
//	}
//}
//
//void CMainUI::OnBtnStop()
//{
//	m_Svr.Close();
//}

//治疗流程开始
void CMainUI::OnBnClickedTreatmodebutton()
{
	ChairMode=1;
	m_report.BeamNum = 0;
	for (size_t i = 0; i < 20; i++)
	{
		m_report.BeamOper[i] = "null";
		m_report.BeamTime[i] = "-1";
		m_report.BeamAngle[i] = "-1";
	}
	m_report.BeamNum = 0;
	ReadConfig();
		//m_treatmentmode.SetColor(BLACK, GREEN);

		//this->GetDlgItem(IDC_CTRLBUTTON)->EnableWindow(FALSE);
		this->GetDlgItem(IDC_ALIGNERBUTTON)->EnableWindow(TRUE);
		this->GetDlgItem(IDC_TREATFINISHBUTTON)->EnableWindow(TRUE);
		this->GetDlgItem(IDC_UPBUTTON)->EnableWindow(FALSE);
		this->GetDlgItem(IDC_DOWNBUTTON)->EnableWindow(FALSE);
		this->GetDlgItem(IDC_TREATMODEBUTTON)->EnableWindow(FALSE);
		this->GetDlgItem(IDC_PLANCOMBO)->EnableWindow(FALSE);
		//this->GetDlgItem(IDC_patientIDEDIT)->EnableWindow(FALSE);
		this->GetDlgItem(IDC_STATICPExit)->ShowWindow(FALSE);
		

		CTabCtrl *tab = (CTabCtrl*)GetParent();//获取父窗口即tab控件指针
		tab->GetDlgItem(IDC_TAB1)->EnableWindow(FALSE);

