AlanYANG0916/RCTSV0.2.1/STC1/MainUI.cpp
		tab->GetDlgItem(IDC_STARTBUTTON)->EnableWindow(FALSE);
		tab->GetDlgItem(IDC_EnBUTTON)->EnableWindow(FALSE);
		tab->GetDlgItem(IDC_LockBUTTON)->EnableWindow(FALSE);
		tab->GetDlgItem(IDC_RESETBUTTON)->EnableWindow(FALSE);
		tab->GetDlgItem(IDC_BUTTON10)->EnableWindow(FALSE);
		tab->GetDlgItem(IDC_BUTTON13)->EnableWindow(FALSE);

		//translation.Offset[3] = M_COORD[3];
		//translation.Offset[4] = M_COORD[4];
		//translation.Offset[5] = M_COORD[5];
		translation.CorrectionFor360Zaxis(ALLcorrectdatafor360);
		for (size_t i = 0; i < 6; i++)
		{
			TTS_coordinate_value[i] = 0;
		}
		TTS_coordinate_value[2] = 270;
}


void CMainUI::OnBnClickedAlignerbutton()//初始化坐标系
{
	CTabCtrl *tab = (CTabCtrl*)GetParent();//获取父窗口即tab控件指针

	for (size_t i = 0; i < 6; i++)
	{
		TTS_coordinate_value[i] = 0;
	}
	TTS_coordinate_value[2] = 270;

	UpdateData(FALSE);
	this->GetDlgItem(IDC_ALIGNERBUTTON)->EnableWindow(FALSE);
	this->GetDlgItem(IDC_CORRBUTTON)->EnableWindow(TRUE);
		SetDlgItemTextW(IDC_360EDIT, L"270");

	DWORD dwCopied = 0;
	double stepnum = 0;
	CString szKeyValue;
	CString m_szFileName = L"./SettingsINI.ini";
	dwCopied = ::GetPrivateProfileString(L"ReferencePoint", L"lat", L"", szKeyValue.GetBuffer(MAX_PATH), MAX_PATH, m_szFileName);
	stepnum = _wtof(szKeyValue.GetBuffer()); ref[3] = stepnum;
	str.Format(L"%.1f", stepnum); tab->SetDlgItemTextW(IDC_AXEDIT, str);
	dwCopied = ::GetPrivateProfileString(L"ReferencePoint", L"long", L"", szKeyValue.GetBuffer(MAX_PATH), MAX_PATH, m_szFileName);
	stepnum = _wtof(szKeyValue.GetBuffer()); ref[4] = stepnum;
	str.Format(L"%.1f", stepnum); tab->SetDlgItemTextW(IDC_AYEDIT, str);
	dwCopied = ::GetPrivateProfileString(L"ReferencePoint", L"vert", L"", szKeyValue.GetBuffer(MAX_PATH), MAX_PATH, m_szFileName);
	stepnum = _wtof(szKeyValue.GetBuffer()); ref[5] = stepnum;
	str.Format(L"%.1f", stepnum); tab->SetDlgItemTextW(IDC_AZEDIT, str);

	dwCopied = ::GetPrivateProfileString(L"360Correction", L"X", L"", szKeyValue.GetBuffer(MAX_PATH), MAX_PATH, m_szFileName);
	stepnum = _wtof(szKeyValue.GetBuffer()); ForZAxisCorr[3] = stepnum;

	dwCopied = ::GetPrivateProfileString(L"360Correction", L"Y", L"", szKeyValue.GetBuffer(MAX_PATH), MAX_PATH, m_szFileName);
	stepnum = _wtof(szKeyValue.GetBuffer()); ForZAxisCorr[4] = stepnum;

	dwCopied = ::GetPrivateProfileString(L"360Correction", L"Z", L"", szKeyValue.GetBuffer(MAX_PATH), MAX_PATH, m_szFileName);
	stepnum = _wtof(szKeyValue.GetBuffer()); ForZAxisCorr[5] = stepnum;

	//this->GetDlgItem(IDC_ESTOPBUTTON2)->EnableWindow(TRUE);
	//this->GetDlgItem(IDC_LockCPositionButton)->EnableWindow(TRUE);

	str.Format(L"%.1f", 0); this->SetDlgItemTextW(IDC_XEDIT2, str);
	str.Format(L"%.1f", 0); this->SetDlgItemTextW(IDC_YEDIT2, str);
	str.Format(L"%.1f", 270); this->SetDlgItemTextW(IDC_ZEDIT2, L"270.0");
	str.Format(L"%.2f", 0); this->SetDlgItemTextW(IDC_AXEDIT2, str);
	str.Format(L"%.2f", 0); this->SetDlgItemTextW(IDC_AYEDIT2, str);
	str.Format(L"%.2f", 0); this->SetDlgItemTextW(IDC_AZEDIT2, str);

}


void CMainUI::OnBnClickedCorrbutton()//做六维校正的操作
{

	translation.Offset[3] = M_COORD[3];
	translation.Offset[4] = M_COORD[4];
	translation.Offset[5] = M_COORD[5];

	single_move_speed_show[0] = 1; single_move_speed_show[1] = 1; single_move_speed_show[2] = 1;
	single_move_speed_show[3] = 10; single_move_speed_show[4] = 10; single_move_speed_show[5] = 10;
	ShowColor = RGB(255, 255, 0);
	CTabCtrl *tab = (CTabCtrl*)GetParent();//获取父窗口即tab控件指针 

										   //this->GetDlgItem(IDC_CORRBUTTON)->EnableWindow(FALSE);
	double NUM;
	double ifRefresh = false;
	GetDlgItemText(IDC_XEDIT2, str); 
	if (str != "") 
	{
		NUM = _wtof(str.GetBuffer());
		TTS_coordinate_value[0] = NUM;
	}
	GetDlgItemText(IDC_YEDIT2, str);
	if (str != "")
	{
		NUM = _wtof(str.GetBuffer());
		TTS_coordinate_value[1] = NUM;
	}
	GetDlgItemText(IDC_ZEDIT2, str);
	if (str != "")
	{
		NUM = _wtof(str.GetBuffer());
		TTS_coordinate_value[2] = NUM;
	}
	TTS_coordinate_value[6] = TTS_coordinate_value[2];
	GetDlgItemText(IDC_AXEDIT2, str);
	if (str != "")
	{
		NUM = _wtof(str.GetBuffer());
		TTS_coordinate_value[3] = NUM*10;
	}
	GetDlgItemText(IDC_AYEDIT2, str);
	if (str != "")
	{
		NUM = _wtof(str.GetBuffer());
		TTS_coordinate_value[4] = NUM*10;
	}
	GetDlgItemText(IDC_AZEDIT2, str);
	if (str != "")
	{
		NUM = _wtof(str.GetBuffer());
		TTS_coordinate_value[5] = NUM*10;
	}

	/*GetDlgItemText(IDC_XEDIT2, str); if (str == "") { AfxMessageBox(_T("Can't input null data, please check your input")); return; }
	GetDlgItemText(IDC_YEDIT2, str); if (str == "") { AfxMessageBox(_T("Can't input null data, please check your input")); return; }
	GetDlgItemText(IDC_ZEDIT2, str); if (str == "") { AfxMessageBox(_T("Can't input null data, please check your input")); return; }
	GetDlgItemText(IDC_AXEDIT2, str); if (str == "") { AfxMessageBox(_T("Can't input null data, please check your input")); return; }
	GetDlgItemText(IDC_AYEDIT2, str); if (str == "") { AfxMessageBox(_T("Can't input null data, please check your input")); return; }
	GetDlgItemText(IDC_AZEDIT2, str); if (str == "") { AfxMessageBox(_T("Can't input null data, please check your input")); return; }*/

	//在TTS中限位
	if ((TTS_coordinate_value[0]>360) || (TTS_coordinate_value[1]>360) || (TTS_coordinate_value[2]>360))
	{
		AfxMessageBox(_T("There is an error in the input value, please check！"));
		return;
	}
	if ((TTS_coordinate_value[0]<0) || (TTS_coordinate_value[1]<0) || (TTS_coordinate_value[2]<0))
	{
		AfxMessageBox(_T("There is an error in the input value, please check！"));
		return;
	}
	if ((TTS_coordinate_value[0]-360)>-60)
	{
		TTS_coordinate_value[0] = TTS_coordinate_value[0] - 360;
	}
	if ((TTS_coordinate_value[1] - 360)>-60)
	{
		TTS_coordinate_value[1] = TTS_coordinate_value[1] - 360;
	}

	//if ((TTS_coordinate_value[0] - FLimitInTTS[0])<360)
	//{
	//	TTS_coordinate_value[0] = FLimitInTTS[0] + 360; AfxMessageBox(_T("The input value exceeds the security range and has been refreshed to a qualified value.")); ifRefresh = true;
	//}
	//if ((TTS_coordinate_value[1] - FLimitInTTS[1])<360)
	//{
	//	TTS_coordinate_value[1] = FLimitInTTS[1] + 360; AfxMessageBox(_T("The input value exceeds the security range and has been refreshed to a qualified value.")); ifRefresh = true;
	//}

	//if ((TTS_coordinate_value[0] - FLimitInTTS[0])<360)
	//{
	//	TTS_coordinate_value[0] = FLimitInTTS[0]+360; AfxMessageBox(_T("The input value exceeds the security range and has been refreshed to a qualified value.")); ifRefresh = true;
	//}
	//if ((TTS_coordinate_value[1] - FLimitInTTS[1])<360)
	//{
	//	TTS_coordinate_value[1] = FLimitInTTS[1] + 360; AfxMessageBox(_T("The input value exceeds the security range and has been refreshed to a qualified value.")); ifRefresh = true;
	//}

	if (TTS_coordinate_value[0] > ULimitInTTS[0])
	{
		TTS_coordinate_value[0] = ULimitInTTS[0]; AfxMessageBox(_T("The input value exceeds the security range and has been refreshed to a qualified value.")); ifRefresh = true;
	}
	else if (TTS_coordinate_value[0] < FLimitInTTS[0])
	{
		TTS_coordinate_value[0] = 360+FLimitInTTS[0]; AfxMessageBox(_T("The input value exceeds the security range and has been refreshed to a qualified value.")); ifRefresh = true;
	}
	else if (TTS_coordinate_value[0] > FLimitInTTS[0]&& TTS_coordinate_value[0]<0)
	{
		TTS_coordinate_value[0] += 360;
	}

	if (TTS_coordinate_value[1] > ULimitInTTS[1] )
	{
		TTS_coordinate_value[1] = ULimitInTTS[1]; AfxMessageBox(_T("The input value exceeds the security range and has been refreshed to a qualified value.")); ifRefresh = true;
	}
	else if (TTS_coordinate_value[1] < FLimitInTTS[1])
	{
		TTS_coordinate_value[1] = 360+FLimitInTTS[1]; AfxMessageBox(_T("The input value exceeds the security range and has been refreshed to a qualified value.")); ifRefresh = true;
	}
	else if (TTS_coordinate_value[1] > FLimitInTTS[1] && TTS_coordinate_value[1]<0)
	{
		TTS_coordinate_value[1] += 360;
	}

	if (TTS_coordinate_value[2] >360 || TTS_coordinate_value[2] <0)
	{
		AfxMessageBox(_T("There is an error in the input value, please check！"));
		return;
	}


