AlanYANG0916/RCTSV0.2.1/STC1/MainUI.cpp
	GetDlgItemText(IDC_360EDIT2, str);
	double QQ = _wtof(str.GetBuffer());

	GetDlgItemText(IDC_360EDIT, str);
	if (str=="")
	{
		AfxMessageBox(_T("Beam Angle can't be null, please check！"));
		return;
	}
	double QQQ = _wtof(str.GetBuffer());
	if (QQ!=QQQ)
	{
		if (IDYES == MessageBox(_T("The two BEAM ANGLE is different, do you want to continue?"), _T("WARNING!"), MB_YESNO))
		{
		}
		else
		{
			return;
		}
	}

	if (abs(TTS_coordinate_value[2]- QQQ)<10)
	{
		if (abs(TTS_coordinate_value[2] - QQQ)>2)
		{
			if (IDYES == MessageBox(_T("Compared with PV beam, input value is more than 2°,do you want to continue?"), _T("WARNING!"), MB_YESNO))
			{
			}
			else
			{
				return;
			}
		}
	}
	else if (abs(TTS_coordinate_value[2] - abs(QQQ - 360))<10)
	{
	 if (abs(TTS_coordinate_value[2] - abs(QQQ - 360))>2)
	{
		 if (IDYES == MessageBox(_T("Compared with PV beam, input value is more than 2°,do you want to continue?"), _T("WARNING!"), MB_YESNO))
		 {
		 }
		 else
		 {
			 return;
		 }
	}
	}
	else
	{
		AfxMessageBox(_T("There is an error in the input value, please check!"));
		return;
	}

	for (size_t i = 3; i < 6; i++)
	{
		if (TTS_coordinate_value[i] > ULimitInTTS[i])
		{
			TTS_coordinate_value[i] = ULimitInTTS[i]; AfxMessageBox(_T("The input value exceeds the security range and has been refreshed to a qualified value.")); ifRefresh = true;
		}
		if (TTS_coordinate_value[i] < FLimitInTTS[i])
		{
			TTS_coordinate_value[i] = FLimitInTTS[i]; AfxMessageBox(_T("The input value exceeds the security range and has been refreshed to a qualified value.")); ifRefresh = true;
		}
	}
	if (ifRefresh == true)
	{
		str.Format(L"%.1f", TTS_coordinate_value[0]); this->SetDlgItemTextW(IDC_XEDIT2, str);
		str.Format(L"%.1f", TTS_coordinate_value[1]); this->SetDlgItemTextW(IDC_YEDIT2, str);
		str.Format(L"%.1f", TTS_coordinate_value[2]); this->SetDlgItemTextW(IDC_ZEDIT2, str);
		str.Format(L"%.2f", TTS_coordinate_value[3] / 10); this->SetDlgItemTextW(IDC_AXEDIT2, str);
		str.Format(L"%.2f", TTS_coordinate_value[4] / 10); this->SetDlgItemTextW(IDC_AYEDIT2, str);
		str.Format(L"%.2f", TTS_coordinate_value[5] / 10); this->SetDlgItemTextW(IDC_AZEDIT2, str);
		return;
	}

	CLogin m_login; m_login.moveingorlogin = 1;
		if (m_login.DoModal() == IDOK)
		{
			
		}
		else
		{
			//CDialogEx::OnCancel();
			return;
		}

		DWORD dwCopied = 0;
		double stepnum = 0;
		CString szKeyValue;
		CString m_szFileName = L"./SettingsINI.ini";

		dwCopied = ::GetPrivateProfileString(L"360Correction", L"X", L"", szKeyValue.GetBuffer(MAX_PATH), MAX_PATH, m_szFileName);
		stepnum = _wtof(szKeyValue.GetBuffer()); ForZAxisCorr[3] = stepnum;
		dwCopied = ::GetPrivateProfileString(L"360Correction", L"Y", L"", szKeyValue.GetBuffer(MAX_PATH), MAX_PATH, m_szFileName);
		stepnum = _wtof(szKeyValue.GetBuffer()); ForZAxisCorr[4] = stepnum;
		dwCopied = ::GetPrivateProfileString(L"360Correction", L"Z", L"", szKeyValue.GetBuffer(MAX_PATH), MAX_PATH, m_szFileName);
		stepnum = _wtof(szKeyValue.GetBuffer()); ForZAxisCorr[5] = stepnum;


		GetDlgItemText(IDC_360EDIT, str);
		if (m_report.BeamNum == 0 && m_report.BeamAngle[m_report.BeamNum] == "-1")
		{
			m_report.BeamAngle[m_report.BeamNum] = str;
		}

		if (m_report.BeamAngle[m_report.BeamNum] != str)
		{
			m_report.BeamNum++;
			m_report.BeamAngle[m_report.BeamNum] = str;
		}
		else if (m_report.BeamAngle[m_report.BeamNum] == str)
		{
			GetDlgItemText(IDC_XEDIT2, str);
			NUM = _wtof(str.GetBuffer());
			m_report.PlanBeamInfo[m_report.BeamNum][0] = NUM;
			GetDlgItemText(IDC_YEDIT2, str);
			NUM = _wtof(str.GetBuffer());
			m_report.PlanBeamInfo[m_report.BeamNum][1] = NUM;
			GetDlgItemText(IDC_ZEDIT2, str);
			NUM = _wtof(str.GetBuffer());
			m_report.PlanBeamInfo[m_report.BeamNum][2] = NUM;
			GetDlgItemText(IDC_AXEDIT2, str);
			NUM = _wtof(str.GetBuffer());
			m_report.PlanBeamInfo[m_report.BeamNum][3] = NUM;
			GetDlgItemText(IDC_AYEDIT2, str);
			NUM = _wtof(str.GetBuffer());
			m_report.PlanBeamInfo[m_report.BeamNum][4] = NUM;
			GetDlgItemText(IDC_AZEDIT2, str);
			NUM = _wtof(str.GetBuffer());
			m_report.PlanBeamInfo[m_report.BeamNum][5] = NUM;
		}

		if (m_report.BeamNum>0)
		{
			GetDlgItemText(IDC_RXEDIT2, str);
			NUM = _wtof(str.GetBuffer());
			m_report.ReBeamInfo[m_report.BeamNum - 1][0] = NUM;
			GetDlgItemText(IDC_RYEDIT2, str);
			NUM = _wtof(str.GetBuffer());
			m_report.ReBeamInfo[m_report.BeamNum - 1][1] = NUM;
			GetDlgItemText(IDC_RZEDIT2, str);
			NUM = _wtof(str.GetBuffer());
			m_report.ReBeamInfo[m_report.BeamNum - 1][2] = NUM;
			GetDlgItemText(IDC_RAXEDIT2, str);
			NUM = _wtof(str.GetBuffer());
			m_report.ReBeamInfo[m_report.BeamNum - 1][3] = NUM ;//从厘米转为毫米
			GetDlgItemText(IDC_RAYEDIT2, str);
			NUM = _wtof(str.GetBuffer());
			m_report.ReBeamInfo[m_report.BeamNum - 1][4] = NUM ;
			GetDlgItemText(IDC_RAZEDIT2, str);
			NUM = _wtof(str.GetBuffer());
			m_report.ReBeamInfo[m_report.BeamNum - 1][5] = NUM ;
		}

		

		m_report.BeamOper[m_report.BeamNum] = UserName;
		CTime tm; tm = CTime::GetCurrentTime();
		int year = tm.GetYear(); int month = tm.GetMonth(); int day = tm.GetDay(); int hour = tm.GetHour(); int minute = tm.GetMinute(); int second = tm.GetSecond();///分钟
		char time[200];
		if (minute<10 && second>10)
		{
			sprintf(time, "%d/%d/%d %d:0%d:%d ", year, month, day, hour, minute, second);
		}
		if (minute>10 && second<10)
		{
			sprintf(time, "%d/%d/%d %d:%d:0%d ", year, month, day, hour, minute, second);
		}
		if (minute<10 && second<10)
		{
			sprintf(time, "%d/%d/%d %d:0%d:0%d ", year, month, day, hour, minute, second);
		}
		if (minute>10 && second>10)
		{
			sprintf(time, "%d/%d/%d %d:%d:%d ", year, month, day, hour, minute, second);
		}

		m_report.BeamTime[m_report.BeamNum] = time;
		//GetDlgItemText(IDC_360EDIT, str);
		//m_report.BeamAngle[m_report.BeamNum]=str;
		for (size_t i = 0; i < 6; i++)
		{
			IfMoveInPlace[i] = 0;
		}
		GetDlgItemText(IDC_XEDIT2, str);
		NUM = _wtof(str.GetBuffer());
		m_report.PlanBeamInfo[m_report.BeamNum][0] = NUM;
		GetDlgItemText(IDC_YEDIT2, str);
		NUM = _wtof(str.GetBuffer());
		m_report.PlanBeamInfo[m_report.BeamNum][1] = NUM;
		GetDlgItemText(IDC_ZEDIT2, str);
		NUM = _wtof(str.GetBuffer());
		m_report.PlanBeamInfo[m_report.BeamNum][2] = NUM;
		GetDlgItemText(IDC_AXEDIT2, str);
		NUM = _wtof(str.GetBuffer());
		m_report.PlanBeamInfo[m_report.BeamNum][3] = NUM;
		GetDlgItemText(IDC_AYEDIT2, str);
		NUM = _wtof(str.GetBuffer());
		m_report.PlanBeamInfo[m_report.BeamNum][4] = NUM;
		GetDlgItemText(IDC_AZEDIT2, str);
		NUM = _wtof(str.GetBuffer());
		m_report.PlanBeamInfo[m_report.BeamNum][5] = NUM;

		if (TTS_coordinate_value[2]<=275&& TTS_coordinate_value[2]>=265)
		{
			str.Format(L"%.1f", 0);
			tab->SetDlgItemTextW(IDC_AZ360EDIT, L"0");
			//GetDlgItemText(IDC_XEDIT2, str);
			//NUM = _wtof(str.GetBuffer());
			//ForZAxisCorr[3] = 0;
		}
		else if (TTS_coordinate_value[2]>275 || TTS_coordinate_value[2]<265)
		{
			tab->GetDlgItemText(IDC_RAZ360EDIT, str);
			double rrr= _wtof(str.GetBuffer());//目前360旋转台的实际位置

			GetDlgItemText(IDC_360EDIT, str);
			NUM = _wtof(str.GetBuffer());//实际的PV Beam值
			double temp = 270 - NUM;
			if (temp >= 180) { temp -= 360; }
			if (temp<-180) { temp += 360; }
			if (abs(180- abs(rrr))<40)//实际位置在70-110的区间内
			{
				if (abs(180 - abs(temp))<15)//目标位置在75-105的区间内
				{
					if (temp - rrr>90)
					{
						int tempp=temp;
						temp = -(360-abs(tempp));
					}
				}
			}
			else
			{

