AlanYANG0916/RCTSV0.2.1/STC1/MainUI.cpp
			}

			//ForZAxisCorr[3] = temp;
			str.Format(L"%.1f", temp);
			tab->SetDlgItemTextW(IDC_AZ360EDIT, str);
			TTS_coordinate_value[2] -= (NUM -270);
			/*TTS_coordinate_value[2] = TTS_coordinate_value[2]-NUM+270;
			if (TTS_coordinate_value[2]>275 || TTS_coordinate_value[2]<265)//忘记填PVBEAM的数值
			{
				temp = 270-TTS_coordinate_value[2];
				if (temp >= 180) { temp -= 360;}
				if (temp<-180) { temp += 360; }
				//ForZAxisCorr[3] = temp;
				str.Format(L"%.1f", temp);
				tab->SetDlgItemTextW(IDC_AZ360EDIT, str); 
				TTS_coordinate_value[2] = 270;	
			}*/
		}
		tab->GetDlgItemText(IDC_AZ360EDIT, str);
		ForZAxisCorr[2] =_wtof( str.GetBuffer());

		
		//trans.Correct3(FIXED_coordinate_value, vector);
		//trans.init();
		//trans.CorrectinTTS(Correctdata, vector);
		translation.MatrixToSolve(TTS_coordinate_value,vector,0);

		//translation.CorrectionFor360Zaxis(ForZAxisCorr, sssForZAxisCorr);
		for (size_t i = 0; i < 6; i++)
		{
			sssForZAxisCorr[i] = 0;// ALLcorrectdatafor360
		}
		if (vector[0]<=2)
		{
			int which = (int)(TTS_coordinate_value[6] + 5) / 10;
			sssForZAxisCorr[3] = ALLcorrectdatafor360[which][0];
			sssForZAxisCorr[4] = ALLcorrectdatafor360[which][1];
		}
		else if(vector[0]>2)
		{
			int which = (int)(TTS_coordinate_value[6] + 5) / 10;
			sssForZAxisCorr[3] = ALLcorrectdatafor360[which][2];
			sssForZAxisCorr[4] = ALLcorrectdatafor360[which][3];
		}
		
		for (size_t i = 0; i < 6; i++)
			 {
			correctdatafor360[i] = sssForZAxisCorr[i];
			}

		//GetXYCORRData(vector);
			
			
		str.Format(L"%.3f", vector[0]); tab->SetDlgItemTextW(IDC_XEDIT, str);
		str.Format(L"%.3f", vector[1]); tab->SetDlgItemTextW(IDC_YEDIT, str);
		str.Format(L"%.3f", vector[2]-270); tab->SetDlgItemTextW(IDC_ZEDIT, str);
		//如果运用第三校正的话，以下平移数值应当不加上TransLatedata里面的值，因为这些值已经在西门子算法中加上了
		//str.Format(L"%.3f", TransLatedata[3] + vector[3]); this->SetDlgItemTextW(IDC_AXEDIT, str);
		//str.Format(L"%.3f", TransLatedata[4] + vector[4]); this->SetDlgItemTextW(IDC_AYEDIT, str);
		//str.Format(L"%.3f", TransLatedata[5] + vector[5]); this->SetDlgItemTextW(IDC_AZEDIT, str);
		str.Format(L"%.3f", vector[3]+ref[3]+ correctdatafor360[3]); tab->SetDlgItemTextW(IDC_AXEDIT, str);
		str.Format(L"%.3f",vector[4]+ref[4]+ correctdatafor360[4]); tab->SetDlgItemTextW(IDC_AYEDIT, str);
		str.Format(L"%.3f", vector[5]+ref[5]+ correctdatafor360[5]); tab->SetDlgItemTextW(IDC_AZEDIT, str);

		//str.Format(L"%.1f", 270-Correctdata[2]); this->SetDlgItemTextW(IDC_AZ360EDIT, str);

		 
		//CWnd *cwnd = tab->GetWindow(GW_CHILD);//获取第一个子窗口指针，即Page1  
											   //CWnd *cwnd1 = cwnd->GetWindow(GW_HWNDNEXT);//获取第一个子窗口后的窗口，即Page2  
		//cwnd->GetDlgItemText(IDC_ZEDIT2, str);//获取Page2上Text控件的值  
		//str = L"SUSS";
		tab->PostMessage(WM_COMMAND, MAKEWPARAM(IDC_movebeginBUTTON, BN_CLICKED), NULL);
		tab->SetWindowText(L"RCTS v0.2   UserName: " + UserName + "  Permission: " + permission);

	this->SetDlgItemTextW(IDC_XEDIT2, L"");
	this->SetDlgItemTextW(IDC_YEDIT2, L"");
	this->SetDlgItemTextW(IDC_ZEDIT2, L"");
	this->SetDlgItemTextW(IDC_AXEDIT2, L"");
	this->SetDlgItemTextW(IDC_AYEDIT2, L"");
	this->SetDlgItemTextW(IDC_AZEDIT2, L"");
}

void CMainUI::REOnBnClickedCorrbutton()//按ctrl做六维校正的操作
{
	CTabCtrl *tab = (CTabCtrl*)GetParent();//获取父窗口即tab控件指针

	/*if (TTS_coordinate_value[6] <= 275 && TTS_coordinate_value[6] >= 265)
	{
		str.Format(L"%.1f", 0);
		tab->SetDlgItemTextW(IDC_AZ360EDIT, L"0");
		//GetDlgItemText(IDC_XEDIT2, str);
		//NUM = _wtof(str.GetBuffer());
		//ForZAxisCorr[3] = 0;
	}

	else if (TTS_coordinate_value[2]>275 || TTS_coordinate_value[2]<265)
	{
		tab->GetDlgItemText(IDC_RAZ360EDIT, str);
		double rrr = _wtof(str.GetBuffer());//目前360旋转台的实际位置

		GetDlgItemText(IDC_360EDIT, str);
		double NUM = _wtof(str.GetBuffer());//实际的PV Beam值
		double temp = 270 - NUM;
		if (temp >= 180) { temp -= 360; }
		if (temp<-180) { temp += 360; }
		if (abs(180 - abs(rrr))<40)//实际位置在70-110的区间内
		{
			if (abs(180 - abs(temp))<15)//目标位置在75-105的区间内
			{
				if (temp - rrr>90)
				{
					int tempp = temp;
					temp = -(360 - abs(tempp));
				}
			}
		}
		else
		{

		}
		str.Format(L"%.1f", temp);
		tab->SetDlgItemTextW(IDC_AZ360EDIT, str);
		TTS_coordinate_value[2] -= (NUM - 270);

	}
	tab->GetDlgItemText(IDC_AZ360EDIT, str);
	ForZAxisCorr[2] = _wtof(str.GetBuffer());*/


	//trans.Correct3(FIXED_coordinate_value, vector);
	//trans.init();
	//trans.CorrectinTTS(Correctdata, vector);
	translation.MatrixToSolve(TTS_coordinate_value, vector, 0);

	//translation.CorrectionFor360Zaxis(ForZAxisCorr, sssForZAxisCorr);
	for (size_t i = 0; i < 6; i++)
	{
		sssForZAxisCorr[i] = 0;// ALLcorrectdatafor360
	}
	int which = (int)(TTS_coordinate_value[6]+5) / 10;
	sssForZAxisCorr[3] = ALLcorrectdatafor360[which][0];
	sssForZAxisCorr[4] = ALLcorrectdatafor360[which][1];

	for (size_t i = 0; i < 6; i++)
	{
		sssForZAxisCorr[i] = 0;// ALLcorrectdatafor360
	}
	if (vector[0] <= 2)
	{
		int which = (int)(TTS_coordinate_value[6] + 5) / 10;
		sssForZAxisCorr[3] = ALLcorrectdatafor360[which][0];
		sssForZAxisCorr[4] = ALLcorrectdatafor360[which][1];
	}
	else if (vector[0]>2)
	{
		int which = (int)(TTS_coordinate_value[6] + 5) / 10;
		sssForZAxisCorr[3] = ALLcorrectdatafor360[which][2];
		sssForZAxisCorr[4] = ALLcorrectdatafor360[which][3];
	}
	//GetXYCORRData(vector);


	str.Format(L"%.3f", vector[0]); tab->SetDlgItemTextW(IDC_XEDIT, str);
	str.Format(L"%.3f", vector[1]); tab->SetDlgItemTextW(IDC_YEDIT, str);
	str.Format(L"%.3f", vector[2] - 270); tab->SetDlgItemTextW(IDC_ZEDIT, str);
	//如果运用第三校正的话，以下平移数值应当不加上TransLatedata里面的值，因为这些值已经在西门子算法中加上了
	//str.Format(L"%.3f", TransLatedata[3] + vector[3]); this->SetDlgItemTextW(IDC_AXEDIT, str);
	//str.Format(L"%.3f", TransLatedata[4] + vector[4]); this->SetDlgItemTextW(IDC_AYEDIT, str);
	//str.Format(L"%.3f", TransLatedata[5] + vector[5]); this->SetDlgItemTextW(IDC_AZEDIT, str);
	str.Format(L"%.3f", vector[3] + ref[3] + sssForZAxisCorr[3]); tab->SetDlgItemTextW(IDC_AXEDIT, str);
	str.Format(L"%.3f", vector[4] + ref[4] + sssForZAxisCorr[4]); tab->SetDlgItemTextW(IDC_AYEDIT, str);
	str.Format(L"%.3f", vector[5] + ref[5] + sssForZAxisCorr[5]); tab->SetDlgItemTextW(IDC_AZEDIT, str);
	tab->PostMessage(WM_COMMAND, MAKEWPARAM(IDC_CTRLBUTTON, BN_CLICKED), NULL);
	//tab->SetWindowText(L"RCTS v0.2   UserName: " + UserName + "  Permission: " + permission);
}

void CMainUI::OnBnClickedTreatfinishbutton()
{
	int standbyorkeep;
	DWORD dwCopied = 0;
	double stepnum = 0;
	CString szKeyValue;
	CString m_szFileName = L"./SettingsINI.ini";
	dwCopied = ::GetPrivateProfileString(L"EndTreatment", L"M", L"", szKeyValue.GetBuffer(MAX_PATH), MAX_PATH, m_szFileName);
	stepnum = _wtof(szKeyValue.GetBuffer()); standbyorkeep = stepnum;

	CLogin m_login;
	m_login.showWaring = true;
	if (m_login.DoModal() == IDOK)
	{

