AlanYANG0916/RCTSV0.2.1/STC1/MainUI.cpp
	}
	else
	{
		//CDialogEx::OnCancel();
		return;
	}
		for (size_t i = 0; i < 3; i++)
		{
			ref[i+3] = 0;
		}
		//m_treatmentmode.SetColor(BLACK, LTGRAY);
		double NUM;
		//if (m_report.BeamNum>0)
		//{
			GetDlgItemText(IDC_RXEDIT2, str);
			NUM = _wtof(str.GetBuffer());
			m_report.ReBeamInfo[m_report.BeamNum ][0] = NUM;
			GetDlgItemText(IDC_RYEDIT2, str);
			NUM = _wtof(str.GetBuffer());
			m_report.ReBeamInfo[m_report.BeamNum ][1] = NUM;
			GetDlgItemText(IDC_RZEDIT2, str);
			NUM = _wtof(str.GetBuffer());
			m_report.ReBeamInfo[m_report.BeamNum ][2] = NUM;
			GetDlgItemText(IDC_RAXEDIT2, str);
			NUM = _wtof(str.GetBuffer());
			m_report.ReBeamInfo[m_report.BeamNum ][3] = NUM;//从厘米转为毫米
			GetDlgItemText(IDC_RAYEDIT2, str);
			NUM = _wtof(str.GetBuffer());
			m_report.ReBeamInfo[m_report.BeamNum ][4] = NUM ;
			GetDlgItemText(IDC_RAZEDIT2, str);
			NUM = _wtof(str.GetBuffer());
			m_report.ReBeamInfo[m_report.BeamNum ][5] = NUM ;
		//}

		ChairMode = 0;
		for (size_t i = 0; i < 3; i++)
		{
			single_move_speed_show[i] = 1;
			ForZAxisCorr[i] = 0;
			sssForZAxisCorr[i] = 0;
			correctdatafor360[i] = 0;
		}
		for (size_t i = 3; i < 6; i++)
		{
			single_move_speed_show[i] = 10;
			ForZAxisCorr[i] = 0;
			sssForZAxisCorr[i] = 0;
			correctdatafor360[i] = 0;
		}

		//this->GetDlgItem(IDC_CTRLBUTTON)->EnableWindow(TRUE);
		this->GetDlgItem(IDC_TREATMODEBUTTON)->EnableWindow(TRUE);
		this->GetDlgItem(IDC_ALIGNERBUTTON)->EnableWindow(FALSE);
		this->GetDlgItem(IDC_CORRBUTTON)->EnableWindow(FALSE);
		this->GetDlgItem(IDC_UPBUTTON)->EnableWindow(TRUE);
		this->GetDlgItem(IDC_DOWNBUTTON)->EnableWindow(TRUE);
		this->GetDlgItem(IDC_TREATFINISHBUTTON)->EnableWindow(FALSE);
		this->GetDlgItem(IDC_PLANCOMBO)->EnableWindow(TRUE);

		//this->GetDlgItem(IDC_patientIDEDIT)->EnableWindow(TRUE);
		this->GetDlgItem(IDC_STATICPExit)->ShowWindow(TRUE);
		trans.init();

		if (standbyorkeep==0)//standby
		{
			OnBnClickedUpbutton();
		}
		else if (standbyorkeep == 1)//keep iso standby
		{
			CTabCtrl *tab = (CTabCtrl*)GetParent();//获取父窗口即tab控件指针 

			DWORD dwCopied = 0;
			double stepnum = 0;
			CString szKeyValue;
			CString m_szFileName = L"./SettingsINI.ini";
			/*dwCopied = ::GetPrivateProfileString(L"StepOn", L"iso", L"", szKeyValue.GetBuffer(MAX_PATH), MAX_PATH, m_szFileName);
			stepnum = _wtof(szKeyValue.GetBuffer());
			stepnum = 270 - stepnum;
			if (stepnum > 180)stepnum = stepnum - 360;
			if (stepnum < -180)stepnum = stepnum + 360;
			str.Format(L"%.0f", stepnum); tab->SetDlgItemTextW(IDC_AZ360EDIT, str);*/
			dwCopied = ::GetPrivateProfileString(L"StepOn", L"pitch", L"", szKeyValue.GetBuffer(MAX_PATH), MAX_PATH, m_szFileName);
			stepnum = _wtof(szKeyValue.GetBuffer());
			str.Format(L"%.1f", stepnum); tab->SetDlgItemTextW(IDC_XEDIT, str);
			dwCopied = ::GetPrivateProfileString(L"StepOn", L"roll", L"", szKeyValue.GetBuffer(MAX_PATH), MAX_PATH, m_szFileName);
			stepnum = _wtof(szKeyValue.GetBuffer());
			str.Format(L"%.1f", stepnum); tab->SetDlgItemTextW(IDC_YEDIT, str);
			dwCopied = ::GetPrivateProfileString(L"StepOn", L"iso", L"", szKeyValue.GetBuffer(MAX_PATH), MAX_PATH, m_szFileName);
			stepnum = _wtof(szKeyValue.GetBuffer());
			str.Format(L"%.1f", stepnum); tab->SetDlgItemTextW(IDC_ZEDIT, str);
			dwCopied = ::GetPrivateProfileString(L"StepOn", L"LeftRight", L"", szKeyValue.GetBuffer(MAX_PATH), MAX_PATH, m_szFileName);
			stepnum = _wtof(szKeyValue.GetBuffer());
			str.Format(L"%.1f", stepnum); tab->SetDlgItemTextW(IDC_AXEDIT, str);
			dwCopied = ::GetPrivateProfileString(L"StepOn", L"FrontBack", L"", szKeyValue.GetBuffer(MAX_PATH), MAX_PATH, m_szFileName);
			stepnum = _wtof(szKeyValue.GetBuffer());
			str.Format(L"%.1f", stepnum); tab->SetDlgItemTextW(IDC_AYEDIT, str);
			dwCopied = ::GetPrivateProfileString(L"StepOn", L"TopBottom", L"", szKeyValue.GetBuffer(MAX_PATH), MAX_PATH, m_szFileName);
			stepnum = _wtof(szKeyValue.GetBuffer());
			str.Format(L"%.1f", stepnum); tab->SetDlgItemTextW(IDC_AZEDIT, str);
			szKeyValue.ReleaseBuffer();

			tab->PostMessage(WM_COMMAND, MAKEWPARAM(IDC_CTRLBUTTON, BN_CLICKED), NULL);//OnBnClickedCtrlbutton();
		}
		
		CTabCtrl *tab = (CTabCtrl*)GetParent();//获取父窗口即tab控件指针 
		/*str.Format(L"%d", 0); tab->SetDlgItemTextW(IDC_XEDIT, str); SetDlgItemTextW(IDC_AXEDIT2, str);
		str.Format(L"%d", 0); tab->SetDlgItemTextW(IDC_YEDIT, str); SetDlgItemTextW(IDC_AYEDIT2, str);
		str.Format(L"%d", 0); tab->SetDlgItemTextW(IDC_ZEDIT, str); SetDlgItemTextW(IDC_AZEDIT2, str);
		str.Format(L"%d", 0); tab->SetDlgItemTextW(IDC_AXEDIT, str); SetDlgItemTextW(IDC_XEDIT2, str);
		str.Format(L"%d", 0); tab->SetDlgItemTextW(IDC_AYEDIT, str); SetDlgItemTextW(IDC_YEDIT2, str);
		str.Format(L"%d", 0); tab->SetDlgItemTextW(IDC_AZEDIT, str); SetDlgItemTextW(IDC_ZEDIT2, L"270");
		str.Format(L"%d", 0); tab->SetDlgItemTextW(IDC_AZ360EDIT, str); 
		
		tab->PostMessage(WM_COMMAND, MAKEWPARAM(IDC_CTRLBUTTON, BN_CLICKED), NULL);*/
		tab->GetDlgItem(IDC_TAB1)->EnableWindow(TRUE);

		tab->GetDlgItem(IDC_STARTBUTTON)->EnableWindow(TRUE);
		tab->GetDlgItem(IDC_EnBUTTON)->EnableWindow(TRUE);
		//tab->GetDlgItem(IDC_LockBUTTON)->EnableWindow(TRUE);
		//tab->GetDlgItem(IDC_RESETBUTTON)->EnableWindow(TRUE);
		//tab->GetDlgItem(IDC_BUTTON10)->EnableWindow(TRUE);
		//tab->GetDlgItem(IDC_BUTTON13)->EnableWindow(TRUE);

		if (PisOpen)//保存相应的治疗过程数据
		{
			bool PlanExist = false;
			mysql_init(&m_sqlCon);//初始化数据库对象
			if (!mysql_real_connect(&m_sqlCon, "localhost", "root", "123456", "chair001", 3306, NULL, 0))//localhost:服务器地址，可以直接填入IP;root:账号;123:密码;test:数据库名;3306:网络端口  
			{
				AfxMessageBox(_T("Database connection failed!"));
				return;
			}
			else//连接成功则继续访问数据库，之后的相关操作代码基本是放在这里面的
			{
				(mysql_query(&m_sqlCon, "SELECT PlanName FROM treatmentreport"));//从users这个表格查询id
				m_res = mysql_store_result(&m_sqlCon);
				while (m_row = mysql_fetch_row(m_res))
				{
					str = m_row[0];
					if (m_report.PlanName == str)
					{
						PlanExist = true;
					}
				}
				if (!PlanExist)//这个计划不存在则插入一个新条目
				{
					str.Format(L"INSERT into treatmentreport (PlanName,PatientID,TreatTimes) VALUES(\"%s\",\"%s\",%d)", m_report.PlanName, m_report.PatientID, m_report.BeamNum);
					const wchar_t* wstr = (LPCTSTR)str;         //一定得是unicode，否则这句话会错的
					char c1[500] = { 0 };
					wcstombs(c1, wstr, wcslen(wstr));
					const char* cc1 = c1;
					mysql_query(&m_sqlCon, cc1);
					PlanExist = true;
				}
				if (PlanExist)
				{
					str.Format(L"SELECT TreatTimes FROM treatmentreport where PlanName = \"%s\"", m_report.PlanName);
					const wchar_t* wstr = (LPCTSTR)str;         //一定得是unicode，否则这句话会错的
					char c1[500] = { 0 };
					wcstombs(c1, wstr, wcslen(wstr));
					const char* cc1 = c1;
					mysql_query(&m_sqlCon, cc1);
					m_res = mysql_store_result(&m_sqlCon);
					m_row = mysql_fetch_row(m_res);
					str = m_row[0];
					int TreatTimes = _wtof(str.GetBuffer());

					str.Format(L"UPDATE treatmentreport SET TreatTimes=%d where PlanName = \"%s\"", TreatTimes + m_report.BeamNum+1, m_report.PlanName);
					wstr = (LPCTSTR)str;         //一定得是unicode，否则这句话会错的
					c1[500] = { 0 };
					wcstombs(c1, wstr, wcslen(wstr));
					cc1 = c1;
					mysql_query(&m_sqlCon, cc1);

					for (size_t i = 0; i < m_report.BeamNum+1; i++)
					{
						str.Format(L"UPDATE treatmentreport SET B%d=\"%.2f,%.2f,%.2f,%.2f,%.2f,%.2f,%.2f,%.2f,%.2f,%.2f,%.2f,%.2f,%s,%s,%s,\" where PlanName = \"%s\"", TreatTimes + i + 1,
							m_report.PlanBeamInfo[i][0], m_report.ReBeamInfo[i][0], m_report.PlanBeamInfo[i][1], m_report.ReBeamInfo[i][1],
							m_report.PlanBeamInfo[i][2], m_report.ReBeamInfo[i][2], m_report.PlanBeamInfo[i][3], m_report.ReBeamInfo[i][3],
							m_report.PlanBeamInfo[i][4], m_report.ReBeamInfo[i][4], m_report.PlanBeamInfo[i][5], m_report.ReBeamInfo[i][5],
							m_report.BeamName[i], m_report.BeamOper[i],m_report.BeamTime[i], m_report.PlanName);
						const wchar_t* wstr = (LPCTSTR)str;         //一定得是unicode，否则这句话会错的
						char c1[500] = { 0 };
						wcstombs(c1, wstr, wcslen(wstr));
						const char* cc1 = c1;
						mysql_query(&m_sqlCon, cc1);
						//m_res = mysql_store_result(&m_sqlCon);
						//m_row = mysql_fetch_row(m_res);
					}

