AlanYANG0916/RCTSV0.2.1/STC1/MainUI.cpp
				}
				mysql_close(&m_sqlCon);//关闭Mysql连接
			}
		}
}

void CMainUI::OnBnClickedUpbutton()//上人姿态
{
	TwoBasicMove = 2;
	ChairMode = 4;
	CTabCtrl *tab = (CTabCtrl*)GetParent();//获取父窗口即tab控件指针 

	DWORD dwCopied = 0;
	double stepnum = 0;
	CString szKeyValue;
	CString m_szFileName = L"./SettingsINI.ini";
	dwCopied = ::GetPrivateProfileString(L"StepOn", L"iso", L"", szKeyValue.GetBuffer(MAX_PATH), MAX_PATH, m_szFileName);
	stepnum = _wtof(szKeyValue.GetBuffer());
	stepnum = 270 - stepnum; 
	if (stepnum > 180)stepnum = stepnum - 360;
	if (stepnum < -180)stepnum = stepnum + 360;
	str.Format(L"%.0f", stepnum); tab->SetDlgItemTextW(IDC_AZ360EDIT, str);
	dwCopied = ::GetPrivateProfileString(L"StepOn", L"pitch", L"", szKeyValue.GetBuffer(MAX_PATH), MAX_PATH, m_szFileName);
	stepnum = _wtof(szKeyValue.GetBuffer());
	str.Format(L"%.1f", stepnum); tab->SetDlgItemTextW(IDC_XEDIT, str);
	dwCopied = ::GetPrivateProfileString(L"StepOn", L"roll", L"", szKeyValue.GetBuffer(MAX_PATH), MAX_PATH, m_szFileName);
	stepnum = _wtof(szKeyValue.GetBuffer());
	str.Format(L"%.1f", stepnum); tab->SetDlgItemTextW(IDC_YEDIT, str);
	dwCopied = ::GetPrivateProfileString(L"StepOn", L"LeftRight", L"", szKeyValue.GetBuffer(MAX_PATH), MAX_PATH, m_szFileName);
	stepnum = _wtof(szKeyValue.GetBuffer());
	str.Format(L"%.1f", stepnum); tab->SetDlgItemTextW(IDC_AXEDIT, str);
	dwCopied = ::GetPrivateProfileString(L"StepOn", L"FrontBack", L"", szKeyValue.GetBuffer(MAX_PATH), MAX_PATH, m_szFileName);
	stepnum = _wtof(szKeyValue.GetBuffer());
	str.Format(L"%.1f", stepnum); tab->SetDlgItemTextW(IDC_AYEDIT, str);
	dwCopied = ::GetPrivateProfileString(L"StepOn", L"TopBottom", L"", szKeyValue.GetBuffer(MAX_PATH), MAX_PATH, m_szFileName);
	stepnum = _wtof(szKeyValue.GetBuffer());
	str.Format(L"%.1f", stepnum); tab->SetDlgItemTextW(IDC_AZEDIT, str);
	szKeyValue.ReleaseBuffer();


	tab->PostMessage(WM_COMMAND, MAKEWPARAM(IDC_movebeginBUTTON, BN_CLICKED), NULL);
	//tab->PostMessage(WM_COMMAND, MAKEWPARAM(IDC_CTRLBUTTON, BN_CLICKED), NULL);//OnBnClickedCtrlbutton();
}

void CMainUI::REOnBnClickedUpbutton()//上人姿态
{
	TwoBasicMove = 2;
	ChairMode = 4;
	CTabCtrl *tab = (CTabCtrl*)GetParent();//获取父窗口即tab控件指针 

	DWORD dwCopied = 0;
	double stepnum = 0;
	CString szKeyValue;
	CString m_szFileName = L"./SettingsINI.ini";
	dwCopied = ::GetPrivateProfileString(L"StepOn", L"iso", L"", szKeyValue.GetBuffer(MAX_PATH), MAX_PATH, m_szFileName);
	stepnum = _wtof(szKeyValue.GetBuffer());
	stepnum = 270 - stepnum;
	if (stepnum > 180)stepnum = stepnum - 360;
	if (stepnum < -180)stepnum = stepnum + 360;
	str.Format(L"%.0f", stepnum); tab->SetDlgItemTextW(IDC_AZ360EDIT, str);
	dwCopied = ::GetPrivateProfileString(L"StepOn", L"pitch", L"", szKeyValue.GetBuffer(MAX_PATH), MAX_PATH, m_szFileName);
	stepnum = _wtof(szKeyValue.GetBuffer());
	str.Format(L"%.1f", stepnum); tab->SetDlgItemTextW(IDC_XEDIT, str);
	dwCopied = ::GetPrivateProfileString(L"StepOn", L"roll", L"", szKeyValue.GetBuffer(MAX_PATH), MAX_PATH, m_szFileName);
	stepnum = _wtof(szKeyValue.GetBuffer());
	str.Format(L"%.1f", stepnum); tab->SetDlgItemTextW(IDC_YEDIT, str);
	dwCopied = ::GetPrivateProfileString(L"StepOn", L"LeftRight", L"", szKeyValue.GetBuffer(MAX_PATH), MAX_PATH, m_szFileName);
	stepnum = _wtof(szKeyValue.GetBuffer());
	str.Format(L"%.1f", stepnum); tab->SetDlgItemTextW(IDC_AXEDIT, str);
	dwCopied = ::GetPrivateProfileString(L"StepOn", L"FrontBack", L"", szKeyValue.GetBuffer(MAX_PATH), MAX_PATH, m_szFileName);
	stepnum = _wtof(szKeyValue.GetBuffer());
	str.Format(L"%.1f", stepnum); tab->SetDlgItemTextW(IDC_AYEDIT, str);
	dwCopied = ::GetPrivateProfileString(L"StepOn", L"TopBottom", L"", szKeyValue.GetBuffer(MAX_PATH), MAX_PATH, m_szFileName);
	stepnum = _wtof(szKeyValue.GetBuffer());
	str.Format(L"%.1f", stepnum); tab->SetDlgItemTextW(IDC_AZEDIT, str);
	szKeyValue.ReleaseBuffer();


	//tab->PostMessage(WM_COMMAND, MAKEWPARAM(IDC_movebeginBUTTON, BN_CLICKED), NULL);
	tab->PostMessage(WM_COMMAND, MAKEWPARAM(IDC_CTRLBUTTON, BN_CLICKED), NULL);//OnBnClickedCtrlbutton();
}


void CMainUI::OnBnClickedDownbutton()
{

	if (PisOpen)
	{
		this->GetDlgItem(IDC_TREATMODEBUTTON)->EnableWindow(TRUE);
	}
	TwoBasicMove = 1;
	ChairMode = 4;
	for (size_t i = 0; i < 6; i++)
	{
		sssForZAxisCorr[i] = 0;
	}
	SetDlgItemTextW(IDC_360EDIT, L"270");
	CTabCtrl *tab = (CTabCtrl*)GetParent();//获取父窗口即tab控件指针 

	DWORD dwCopied = 0;
	double stepnum = 0;
	CString szKeyValue;
	CString m_szFileName = L"./SettingsINI.ini";
	dwCopied = ::GetPrivateProfileString(L"ReferencePoint", L"lat", L"", szKeyValue.GetBuffer(MAX_PATH), MAX_PATH, m_szFileName);
	stepnum = _wtof(szKeyValue.GetBuffer());// ref[3] = stepnum;
	str.Format(L"%.1f", stepnum); tab->SetDlgItemTextW(IDC_AXEDIT, str);
	dwCopied = ::GetPrivateProfileString(L"ReferencePoint", L"long", L"", szKeyValue.GetBuffer(MAX_PATH), MAX_PATH, m_szFileName);
	stepnum = _wtof(szKeyValue.GetBuffer()); //ref[4] = stepnum;
	str.Format(L"%.1f", stepnum); tab->SetDlgItemTextW(IDC_AYEDIT, str);
	dwCopied = ::GetPrivateProfileString(L"ReferencePoint", L"vert", L"", szKeyValue.GetBuffer(MAX_PATH), MAX_PATH, m_szFileName);
	stepnum = _wtof(szKeyValue.GetBuffer());// ref[5] = stepnum;
	str.Format(L"%.1f", stepnum); tab->SetDlgItemTextW(IDC_AZEDIT, str);
	//szKeyValue.ReleaseBuffer();




	szKeyValue.ReleaseBuffer();

	str.Format(L"%d", 0); tab->SetDlgItemTextW(IDC_XEDIT, str);
	str.Format(L"%d", 0); tab->SetDlgItemTextW(IDC_YEDIT, str);
	str.Format(L"%d", 0); tab->SetDlgItemTextW(IDC_ZEDIT, str);
	str.Format(L"%d", 5); tab->SetDlgItemTextW(IDC_AZ360EDIT, str);
	REset = true;
	//str.Format(L"%d", 270); SetDlgItemTextW(IDC_360EDIT, str);
	tab->PostMessage(WM_COMMAND, MAKEWPARAM(IDC_movebeginBUTTON, BN_CLICKED), NULL);
	//tab->PostMessage(WM_COMMAND, MAKEWPARAM(IDC_CTRLBUTTON, BN_CLICKED), NULL);//OnBnClickedCtrlbutton();


	for (size_t i = 0; i < 3; i++)
	{
		ref[i] = 0;
	}


	/*CTabCtrl *tab = (CTabCtrl*)GetParent();//获取父窗口即tab控件指针 
	CString str;
	double num = 5;
	str.Format(L"%.1f", num);
	tab->SetDlgItemTextW(IDC_AZ360EDIT, str);
	REset = true;
	str.Format(L"%d", 0); tab->SetDlgItemTextW(IDC_XEDIT, str);
	str.Format(L"%d", 0); tab->SetDlgItemTextW(IDC_YEDIT, str);
	str.Format(L"%d", 0); tab->SetDlgItemTextW(IDC_ZEDIT, str);
	str.Format(L"%d", 0); tab->SetDlgItemTextW(IDC_AXEDIT, str);
	str.Format(L"%d", 0); tab->SetDlgItemTextW(IDC_AYEDIT, str);
	str.Format(L"%d", 0); tab->SetDlgItemTextW(IDC_AZEDIT, str);
	tab->PostMessage(WM_COMMAND, MAKEWPARAM(IDC_CTRLBUTTON, BN_CLICKED), NULL);*/

