AlanYANG0916/RCTSV0.2.1/STC1/MainUI.cpp
}

void CMainUI::REOnBnClickedDownbutton()
{
	if (PisOpen)
	{
		this->GetDlgItem(IDC_TREATMODEBUTTON)->EnableWindow(TRUE);
	}
	TwoBasicMove = 1;
	ChairMode = 4;
	for (size_t i = 0; i < 6; i++)
	{
		ForZAxisCorr[i] = 0;
	}
	SetDlgItemTextW(IDC_360EDIT, L"270");
	CTabCtrl *tab = (CTabCtrl*)GetParent();//获取父窗口即tab控件指针 

	DWORD dwCopied = 0;
	double stepnum = 0;
	CString szKeyValue;
	CString m_szFileName = L"./SettingsINI.ini";
	dwCopied = ::GetPrivateProfileString(L"ReferencePoint", L"lat", L"", szKeyValue.GetBuffer(MAX_PATH), MAX_PATH, m_szFileName);
	stepnum = _wtof(szKeyValue.GetBuffer());// ref[3] = stepnum;
	str.Format(L"%.1f", stepnum); tab->SetDlgItemTextW(IDC_AXEDIT, str);
	dwCopied = ::GetPrivateProfileString(L"ReferencePoint", L"long", L"", szKeyValue.GetBuffer(MAX_PATH), MAX_PATH, m_szFileName);
	stepnum = _wtof(szKeyValue.GetBuffer()); //ref[4] = stepnum;
	str.Format(L"%.1f", stepnum); tab->SetDlgItemTextW(IDC_AYEDIT, str);
	dwCopied = ::GetPrivateProfileString(L"ReferencePoint", L"vert", L"", szKeyValue.GetBuffer(MAX_PATH), MAX_PATH, m_szFileName);
	stepnum = _wtof(szKeyValue.GetBuffer());// ref[5] = stepnum;
	str.Format(L"%.1f", stepnum); tab->SetDlgItemTextW(IDC_AZEDIT, str);
	//szKeyValue.ReleaseBuffer();




	szKeyValue.ReleaseBuffer();

	str.Format(L"%d", 0); tab->SetDlgItemTextW(IDC_XEDIT, str);
	str.Format(L"%d", 0); tab->SetDlgItemTextW(IDC_YEDIT, str);
	str.Format(L"%d", 0); tab->SetDlgItemTextW(IDC_ZEDIT, str);
	str.Format(L"%d", 5); tab->SetDlgItemTextW(IDC_AZ360EDIT, str);
	REset = true;
	//str.Format(L"%d", 270); SetDlgItemTextW(IDC_360EDIT, str);
	//tab->PostMessage(WM_COMMAND, MAKEWPARAM(IDC_movebeginBUTTON, BN_CLICKED), NULL);
	tab->PostMessage(WM_COMMAND, MAKEWPARAM(IDC_CTRLBUTTON, BN_CLICKED), NULL);//OnBnClickedCtrlbutton();


	for (size_t i = 0; i < 3; i++)
	{
		ref[i] = 0;
	}

}
//BOOL CMainUI::PreTranslateMessage(MSG* pMsg)
//{
//	if (m_hAccel)
//	{
//		if (::TranslateAccelerator(m_hWnd, m_hAccel, pMsg))
//		{
//			return(TRUE);
//		}
//	}
//	return CDialog::PreTranslateMessage(pMsg);
//}

//LRESULT CMainUI::OnHotKey(WPARAM wParam, LPARAM lParam)
//{
//	if(wParam == 1000)
//		OnBnClickedTreatmodebutton();
//	//ToDo: add function 
//	return 0;
//}
//
//void CMainUI::OnDestroy()
//{
//	::UnregisterHotKey(GetSafeHwnd(), 1000);//销毁热键 
//}

void CMainUI::OnOK()
{
	//   CDialog::OnOK(); 
	CRect rect;
	m_patientidedit.GetWindowRect(&rect);
	CPoint  pt;
	GetCursorPos(&pt);

	bool ifFouse[7] = {false};

	//if (rect.PtInRect(pt)&&ChairMode==0)
	if (ChairMode == 0&&(!PisOpen))
	{
		//在m_patientidedit区域内
		OnStnClickedStaticpexit();
	}

	GetDlgItem(IDC_AXEDIT2)->GetWindowRect(&rect); GetCursorPos(&pt); ifFouse[0]=rect.PtInRect(pt);
	GetDlgItem(IDC_AYEDIT2)->GetWindowRect(&rect); GetCursorPos(&pt); ifFouse[1] = rect.PtInRect(pt);
	GetDlgItem(IDC_AZEDIT2)->GetWindowRect(&rect); GetCursorPos(&pt); ifFouse[2] = rect.PtInRect(pt);
	GetDlgItem(IDC_XEDIT2)->GetWindowRect(&rect); GetCursorPos(&pt); ifFouse[3] = rect.PtInRect(pt);
	GetDlgItem(IDC_YEDIT2)->GetWindowRect(&rect); GetCursorPos(&pt); ifFouse[4] = rect.PtInRect(pt);
	GetDlgItem(IDC_ZEDIT2)->GetWindowRect(&rect); GetCursorPos(&pt); ifFouse[5] = rect.PtInRect(pt);
	GetDlgItem(IDC_360EDIT)->GetWindowRect(&rect); GetCursorPos(&pt); ifFouse[6] = rect.PtInRect(pt);
	//if ((ifFouse[0]|| ifFouse[1] || ifFouse[2] || ifFouse[3] || ifFouse[4] || ifFouse[5] || ifFouse[6]) && ChairMode == 1)
	if (ChairMode == 1)
	{
		OnBnClickedCorrbutton();
	}
}

void CMainUI::OnEnSetfocuspatientidedit()
{
	GetDlgItemText(IDC_patientIDEDIT, str);
	if (str == L"Patient ID")
	{
		SetDlgItemTextW(IDC_patientIDEDIT, L"");
	}
}

void CMainUI::OnEnKillfocuspatientidedit()
{
	GetDlgItemText(IDC_patientIDEDIT, str);
	if (str == L"")
	{
		SetDlgItemTextW(IDC_patientIDEDIT, L"Patient ID");
	}
}

void CMainUI::LinkToESB2()
{
	CoInitialize(NULL);//初始化com环境  

	ISoapSerializerPtr Serializer;
	ISoapReaderPtr Reader;
	ISoapConnectorPtr Connector;

	Connector.CreateInstance(__uuidof(HttpConnector30));   //创建对象  


	Connector->Property[_T("EndPointURL")] = _T("http://WebXml.com.cn/getMobileCodeInfo/WebServices/MobileCodeWS.asmx");    //wsdl路径  
	Connector->Connect();

	////   Begin  the   message.  //消息体  
	//Connector->Property[_T("SoapAction")] = _T("http://WebXml.com.cn/qqCheckOnline");//函数体参数  
	Connector->BeginMessage();


	Serializer.CreateInstance(__uuidof(SoapSerializer30));
	Serializer->Init(_variant_t((IUnknown*)Connector->InputStream));

	//   Build  the   SOAP   Message.  

	Serializer->StartEnvelope(_T("soapenv"), _T("http://schemas.xmlsoap.org/soap/envelope/"), _T("utf-8"));
	Serializer->SoapAttribute("web", "", "http://WebXml.com.cn/", "xmlns");
	Serializer->StartHeader("Header");
	Serializer->EndHeader();
	Serializer->StartBody("Body");
	Serializer->StartElement(_T("getMobileCodeInfo"), _T(""), _T(""), _T("web"));//函数处理
		Serializer->StartElement(_T("mobileCode"), _T(""), _T(""), _T(""));
			Serializer->WriteString("18708115927");
		Serializer->EndElement();
	Serializer->EndElement();
	Serializer->EndBody();
	Serializer->EndEnvelope();
	Connector->EndMessage();

	Reader.CreateInstance(__uuidof(SoapReader30));
	//wprintf(_T("here"));
	Reader->Load(_variant_t((IUnknown*)Connector->OutputStream), "");  //加载返回数据  
																   
																	   //   Display  the   result.  
	MSXML2::IXMLDOMElementPtr pstr = Reader->RpcResult;
	char buff[1024] = { 0 };
	strncpy(buff, pstr->text, 1024);
	str.Format(L"%s", buff);
	//SetDlgItemTextW(IDC_STATIC4, str);

	CString        m_HttpCode;
	UINT           PageCode;   //CP_UTF8:65001 CP_ACP:0  转换代码用  
	PageCode = 65001; //因为我们的网址是UTF8格式，所以用65001；
	int nBufferSize = MultiByteToWideChar(PageCode, 0, (LPCSTR)buff, -1, NULL, 0);

	wchar_t *pBuffer = new wchar_t[nBufferSize + 1];
	memset(pBuffer, 0, (nBufferSize + 1) * sizeof(wchar_t));

	//gb2312转为unicode,则用CP_ACP  
	//gbk转为unicode,也用CP_ACP  
	//utf-8转为unicode,则用CP_UTF8  
	MultiByteToWideChar(PageCode, 0, (LPCSTR)buff, -1, pBuffer, nBufferSize * sizeof(wchar_t));

