AlanYANG0916/RCTSV0.2.1/STC1/MainUI.cpp
	m_HttpCode += pBuffer;
	//m_HttpCode += "\r\n";
	delete pBuffer;


	//多余。
	CFile file;
	file.Open(_T("test.txt"), CFile::modeCreate | CFile::modeNoTruncate | CFile::modeReadWrite);
	file.Write(m_HttpCode, m_HttpCode.GetLength());
	file.Close();

	//printf("Answer:%s\n", buff);
	CoUninitialize(); 
}



void CMainUI::LinkToESB()
{

	CoInitialize(NULL);//初始化com环境  

	ISoapSerializerPtr Serializer;
	ISoapReaderPtr Reader;
	ISoapConnectorPtr Connector;

	Connector.CreateInstance(__uuidof(HttpConnector30));   //创建对象  

	Connector->Property[_T("EndPointURL")] = _T("http://10.20.0.10:8998/chair/?wsdl");    //wsdl路径  http://10.20.0.10:8998/chair/?wsdl
	Connector->Connect();

	////   Begin  the   message.  //消息体  
	Connector->BeginMessage();


	Serializer.CreateInstance(__uuidof(SoapSerializer30));
	Serializer->Init(_variant_t((IUnknown*)Connector->InputStream));

	Serializer->StartEnvelope(_T("soapenv"), "http://schemas.xmlsoap.org/soap/envelope/", _T("utf-8"));
	Serializer->SoapAttribute("shth", "", "http://SHTH.ESB.ServiceProvider/", "xmlns");
	//Serializer->StartHeader("Header");
	//Serializer->EndHeader();
	Serializer->StartBody(L"NONE");
	Serializer->SoapAttribute("Body", "", "", "soapenv");  
	//Serializer->StartBody("Body");
		Serializer->StartElement(_T("getPatState"), _T(""), _T(""), _T("shth"));
			Serializer->StartElement(_T("arg0"), _T(""), _T(""), _T(""));
			GetDlgItemText(IDC_patientIDEDIT, m_report.PatientID);
			str.Format(L"&lt;getpatstate patientid = '%s'/&gt;", m_report.PatientID);
			//str = "&lt;getpatstate patientid='20019591'/&gt;";
			const wchar_t* wstr = (LPCTSTR)str; 
			char c[256] = { 0 };
			wcstombs(c, wstr, wcslen(wstr));
			const char* fname = c;
			Serializer->WriteXml(fname);
			Serializer->EndElement();
		Serializer->EndElement();
		Serializer->EndBody();
	Serializer->EndEnvelope();
	Connector->EndMessage();


	Reader = NULL;
	Reader.CreateInstance(__uuidof(SoapReader30));
	//wprintf(_T("here"));
	Reader->Load(_variant_t((IUnknown*)Connector->OutputStream), "");  //加载返回数据  
	//SetDlgItemText(IDC_EDIT1, (const char*)Reader->RpcResult->);
																	   
																	   //   Display  the   result.  
	MSXML2::IXMLDOMElementPtr pstr = Reader->RpcResult;
	char buff[1024] = { 0 };

	strncpy(buff, pstr->text, 1024);
	CFile file2;
	file2.Open(_T("ESBtest2.txt"), CFile::modeCreate | CFile::modeNoTruncate | CFile::modeReadWrite);
	file2.Write(buff, 1024);
	file2.Close();

	
	str.Format(L"%s", buff);

	CString        m_HttpCode;
	UINT           PageCode;   //CP_UTF8:65001 CP_ACP:0  
	PageCode = 54936; //因为我们的网址是UTF8格式，所以用65001；
	int nBufferSize = MultiByteToWideChar(PageCode, 0, (LPCSTR)buff, -1, NULL, 0);

	wchar_t *pBuffer = new wchar_t[nBufferSize + 1];
	memset(pBuffer, 0, (nBufferSize + 1) * sizeof(wchar_t));

	//gb2312转为unicode,则用CP_ACP  
	//gbk转为unicode,也用CP_ACP  
	//utf-8转为unicode,则用CP_UTF8  
	MultiByteToWideChar(PageCode, 0, (LPCSTR)buff, -1, pBuffer, nBufferSize * sizeof(wchar_t));//到这里转为了utf-16

	PageCode = 0; //因为我们的网址是UTF8格式，所以用65001；
	//nBufferSize = WideCharToMultiByte(PageCode, 0, (LPCSTR)buff, -1, NULL, 0);
	char buff2[1024] = { 0 };
	WideCharToMultiByte(CP_UTF8, 0, pBuffer, -1, buff2, 0,NULL,NULL);


	m_HttpCode += buff2;

	delete pBuffer;


	CFile file;
	file.Open(_T("ESBtest.txt"), CFile::modeCreate | CFile::modeNoTruncate | CFile::modeReadWrite);
	file.Write(m_HttpCode, 2*m_HttpCode.GetLength());
	file.Close();

	//printf("Answer:%s\n", buff);
	CoUninitialize();

	//处理接收到的数据
	CString result; int UsefulStringCOunt = 0;
	for (size_t i = 0; i < 1024; i++)
	{
		if (buff[i]==0x3E)//">"符号
		{
			UsefulStringCOunt++;
			result = "";
		}
		else if (buff[i] == 0x3C)//"<"符号
		{
			if (UsefulStringCOunt == 3)
			{
				m_report.PatientBirth = result;
				str.Format(L"%s%s", L"Birth:  ", m_report.PatientBirth); SetDlgItemText(IDC_patientbirth,str);
			}
			if (UsefulStringCOunt == 5)
			{
				m_report.PatientID = result;
				str.Format(L"%s%s", L"PatientID:  ", m_report.PatientID); SetDlgItemText(IDC_patientid, str);
			}
			if (UsefulStringCOunt == 7)
			{
				m_report.PatientName = result;
				str.Format(L"%s%s", L"PatientName:  ", m_report.PatientName); SetDlgItemText(IDC_patientname, str);
			}
		}
		else
		{
			result += buff[i];
		}		
	}
	if (UsefulStringCOunt<4)
	{
		MessageBox(L"There is no information in system,please check the ID!");
	}
}

void CMainUI::ReadConfig()
{
	DWORD dwCopied = 0;
	CString szKeyValue;
	CString m_szFileName= L"./SettingsINI.ini";
	dwCopied = ::GetPrivateProfileString(L"LimitInTTS", L"pitch", L"",szKeyValue.GetBuffer(MAX_PATH), MAX_PATH, m_szFileName);
	ULimitInTTS[0] = _wtof(szKeyValue.GetBuffer());
	szKeyValue.ReleaseBuffer();
	dwCopied = ::GetPrivateProfileString(L"LimitInTTS", L"roll", L"", szKeyValue.GetBuffer(MAX_PATH), MAX_PATH, m_szFileName);
	ULimitInTTS[1] = _wtof(szKeyValue.GetBuffer());
	szKeyValue.ReleaseBuffer();
	dwCopied = ::GetPrivateProfileString(L"LimitInTTS", L"iso", L"", szKeyValue.GetBuffer(MAX_PATH), MAX_PATH, m_szFileName);
	ULimitInTTS[2] = _wtof(szKeyValue.GetBuffer());
	szKeyValue.ReleaseBuffer();
	dwCopied = ::GetPrivateProfileString(L"LimitInTTS", L"lat", L"", szKeyValue.GetBuffer(MAX_PATH), MAX_PATH, m_szFileName);
	ULimitInTTS[3] = _wtof(szKeyValue.GetBuffer());
	szKeyValue.ReleaseBuffer();
	dwCopied = ::GetPrivateProfileString(L"LimitInTTS", L"long", L"", szKeyValue.GetBuffer(MAX_PATH), MAX_PATH, m_szFileName);
	ULimitInTTS[4] = _wtof(szKeyValue.GetBuffer());
	szKeyValue.ReleaseBuffer();
	dwCopied = ::GetPrivateProfileString(L"LimitInTTS", L"vert", L"", szKeyValue.GetBuffer(MAX_PATH), MAX_PATH, m_szFileName);
	ULimitInTTS[5] = _wtof(szKeyValue.GetBuffer());
	szKeyValue.ReleaseBuffer();

	dwCopied = ::GetPrivateProfileString(L"LimitInTTS", L"mpitch", L"", szKeyValue.GetBuffer(MAX_PATH), MAX_PATH, m_szFileName);
	FLimitInTTS[0] = _wtof(szKeyValue.GetBuffer());
	szKeyValue.ReleaseBuffer();
	dwCopied = ::GetPrivateProfileString(L"LimitInTTS", L"mroll", L"", szKeyValue.GetBuffer(MAX_PATH), MAX_PATH, m_szFileName);
	FLimitInTTS[1] = _wtof(szKeyValue.GetBuffer());
	szKeyValue.ReleaseBuffer();
	dwCopied = ::GetPrivateProfileString(L"LimitInTTS", L"miso", L"", szKeyValue.GetBuffer(MAX_PATH), MAX_PATH, m_szFileName);
	FLimitInTTS[2] = _wtof(szKeyValue.GetBuffer());
	szKeyValue.ReleaseBuffer();
	dwCopied = ::GetPrivateProfileString(L"LimitInTTS", L"mlat", L"", szKeyValue.GetBuffer(MAX_PATH), MAX_PATH, m_szFileName);
	FLimitInTTS[3] = _wtof(szKeyValue.GetBuffer());
	szKeyValue.ReleaseBuffer();
	dwCopied = ::GetPrivateProfileString(L"LimitInTTS", L"mlong", L"", szKeyValue.GetBuffer(MAX_PATH), MAX_PATH, m_szFileName);
	FLimitInTTS[4] = _wtof(szKeyValue.GetBuffer());
	szKeyValue.ReleaseBuffer();
	dwCopied = ::GetPrivateProfileString(L"LimitInTTS", L"mvert", L"", szKeyValue.GetBuffer(MAX_PATH), MAX_PATH, m_szFileName);
	FLimitInTTS[5] = _wtof(szKeyValue.GetBuffer());
	szKeyValue.ReleaseBuffer();

