AlanYANG0916/RCTSV0.2.1/STC1/MainUI.cpp
}

//主要接口，输入网址，获取代码
BOOL CMainUI::GetHttpCode(CString &url)
{
	CString        m_strError;  //接受错误信息
	CString        m_HttpCode;  //接受抓取的网页代码
	UINT           PageCode;   //CP_UTF8:65001 CP_ACP:0  转换代码用  

	PageCode = 65001; //因为我们的网址是UTF8格式，所以用65001；
	m_HttpCode = _T("");

	const TCHAR szHeaders[] = _T("Accept: _T/*\r\nUser-Agent: LCD's Infobay Http Client\r\n");

	//获取网页的初始化工作
	CInternetSession session(NULL, 0);
	CHttpFile *htmlFile = NULL;
	TCHAR sRecv[1024];  //接受缓存代码。

						//错误判断初始化
	DWORD dwServiceType = 0;
	DWORD  dwHttpRequestFlags = INTERNET_FLAG_EXISTING_CONNECT | INTERNET_FLAG_NO_AUTO_REDIRECT;
	CString strServerName = _T("");
	CString strObject = _T("");
	INTERNET_PORT nPort = 0;
	CString StrContent = _T("");
	DWORD dwRetcode = -1;

	CHttpConnection *pServer = NULL;

	try
	{
		//if (!OnInitSession(session)) //判断链接是否成功；可以不要
		//{
			//return NULL;
		//}
		if (!AfxParseURL(url, dwServiceType, strServerName, strObject, nPort) || dwServiceType != INTERNET_SERVICE_HTTP)
		{
			m_strError = _T("非法的URL");
			AfxMessageBox(m_strError);
			return FALSE;
		}

		pServer = session.GetHttpConnection(strServerName, nPort);


		if (pServer == NULL)
		{
			m_strError = _T("无法与服务器建立连接");
			AfxMessageBox(m_strError);
			return FALSE;
		}
		//下面第一个可以为1  打开http链接
		htmlFile = pServer->OpenRequest(CHttpConnection::HTTP_VERB_GET, strObject,
			NULL, 1, NULL, NULL, dwHttpRequestFlags);

		if (htmlFile == NULL)
		{
			m_strError = _T("无法与服务器建立连接");
			AfxMessageBox(m_strError);
			return FALSE;
		}

		/////////////////////////////////////////////////
		try
		{ //调用此成员函数添加一个或多个HTTP请求标头到HTTP请求处理。AddRequestHeaders
		  //
			if (!htmlFile->AddRequestHeaders(szHeaders) || !htmlFile->SendRequest())
			{
				m_strError = _T("网络错误－无法发送请求报头");
				AfxMessageBox(m_strError);
				return FALSE;
			}
		}
		catch (CInternetException *ex)
		{
			StrContent.Empty();
			m_strError = _T("无法发送http报头,可能网络状况有问题");
			AfxMessageBox(m_strError);
			ex->Delete();
			return FALSE;
		}
		//////////////////////////////////////////////////////////////////////////

		if (!htmlFile->QueryInfoStatusCode(dwRetcode))
		{
			m_strError = _T("网络错误－无法查询反馈代码");
			AfxMessageBox(m_strError);
			return FALSE;
		}

		if (dwRetcode >= 200 && dwRetcode < 300)
		{
			try
			{
				//htmlFile = (CHttpFile*)session.OpenURL(url);//打开链接

				while (htmlFile->ReadString(sRecv, 1024))
				{
					// 编码转换，可解决中文乱码问题  
					//gb2312转为unicode,则用CP_ACP  
					//gbk转为unicode,也用CP_ACP  
					//utf-8转为unicode,则用CP_UTF8  

					int nBufferSize = MultiByteToWideChar(PageCode, 0, (LPCSTR)sRecv, -1, NULL, 0);

					wchar_t *pBuffer = new wchar_t[nBufferSize + 1];
					memset(pBuffer, 0, (nBufferSize + 1) * sizeof(wchar_t));

					//gb2312转为unicode,则用CP_ACP  
					//gbk转为unicode,也用CP_ACP  
					//utf-8转为unicode,则用CP_UTF8  
					MultiByteToWideChar(PageCode, 0, (LPCSTR)sRecv, -1, pBuffer, nBufferSize * sizeof(wchar_t));

					m_HttpCode += pBuffer;
					m_HttpCode += "\r\n";
					delete pBuffer;
				}

				htmlFile->Close();
				session.Close();
				delete htmlFile;

				//多余。
				//CFile file;
				//file.Open(_T("test2.txt"), CFile::modeCreate | CFile::modeNoTruncate | CFile::modeReadWrite);
				//file.Write(m_HttpCode, m_HttpCode.GetLength());
				//file.Close();

				//return m_HttpCode;

			}
			catch (CInternetException* pEx)
			{
				m_strError = _T("接收数据错误");
				AfxMessageBox(m_strError);
				pEx->Delete();

				//因为是CString,所以返回NULL，而不是0；
				return NULL;
			}
			return TRUE;

		}
		else
		{
			//读取失败，将buffer清空。
			StrContent.Empty();

			//发送错误。
			AfxMessageBox(_T("未成功"));
			//OnProcessError(dwRetcode, session, pServer, htmlFile);

			return FALSE;
		}

	}
	catch (CInternetException* pEx)
	{
		m_strError = _T("网络错误");
		AfxMessageBox(_T("网络错误"));
		pEx->Delete();
		return FALSE;
	}

	return TRUE;
}

void CMainUI::OnSavereport()
{
	const char *page_title = "Chair System Treatment Report";

	HPDF_Doc  pdf;
	HPDF_Font font, font2;
	HPDF_Page page;
	char fname[256];
	int ypos = 450;

	strcpy(fname, "D:\\");
	strcat(fname, "pdftest");
	strcat(fname, ".pdf");

	pdf = HPDF_New(nullptr, nullptr);
	if (!pdf)
	{
		MessageBox(_T("error: cannot create PdfDoc object\n"));
		return;
	}

	/* set compression mode */
	HPDF_SetCompressionMode(pdf, HPDF_COMP_ALL);
	HPDF_STATUS status;
	HPDF_UseCNSFonts(pdf);
	HPDF_UseCNSEncodings(pdf);
	/* create default-font */
	font = HPDF_GetFont(pdf, "SimHei", "GB-EUC-H");
	font2 = HPDF_GetFont(pdf, "SimSun", "GB-EUC-H");

	/* add a new page object. */
	page = HPDF_AddPage(pdf);

	status = HPDF_Page_SetFontAndSize(page, font, 30);
	float tw = HPDF_Page_TextWidth(page, page_title);
	status = HPDF_Page_BeginText(page);
	//show_description(page, 60, ypos - 50,
	//"RenderingMode=PDF_STROKE");
	HPDF_Page_SetTextRenderingMode(page, HPDF_FILL_CLIPPING);
	status = HPDF_Page_TextOut(page, (HPDF_Page_GetWidth(page) - tw) / 2,
		HPDF_Page_GetHeight(page) - 50, page_title);

	status = HPDF_Page_SetFontAndSize(page, font, 15);
	status = HPDF_Page_TextOut(page, 50, HPDF_Page_GetHeight(page) - 100, "Name  :");
	status = HPDF_Page_TextOut(page, 50, HPDF_Page_GetHeight(page) - 130, "Gender  :");
	status = HPDF_Page_TextOut(page, 50, HPDF_Page_GetHeight(page) - 160, "Date of brith  :");
	status = HPDF_Page_TextOut(page, 50, HPDF_Page_GetHeight(page) - 190, "ID  :");

	status = HPDF_Page_TextOut(page, 50, HPDF_Page_GetHeight(page) - 260, "Fraction sequence  :");
	status = HPDF_Page_TextOut(page, 50, HPDF_Page_GetHeight(page) - 290, "Treatment plan  :");

	status = HPDF_Page_EndText(page);

	/* save the document to a file */
	HPDF_SaveToFile(pdf, fname);

	/* clean up */
	HPDF_Free(pdf);
}


HBRUSH CMainUI::OnCtlColor(CDC* pDC, CWnd* pWnd, UINT nCtlColor)
{
	HBRUSH hbr = CDialogEx::OnCtlColor(pDC, pWnd, nCtlColor);

	// TODO:  在此更改 DC 的任何特性

	// TODO:  Change any attributes of the DC here   
	if (nCtlColor == CTLCOLOR_EDIT)
	{
		switch (pWnd->GetDlgCtrlID())
		{
		case IDC_RXEDIT2:
			if (IfMoveInPlace[0]==0){ pDC->SetTextColor(RGB(255,255,0)); }
			else if (IfMoveInPlace[0] == 1) { pDC->SetTextColor(RGB(0, 255, 0)); }
			//pDC->SetTextColor(ShowColor);
			pDC->SetBkColor(RGB(255, 0, 0));
			pDC->SetBkMode(TRANSPARENT);
			return (HBRUSH)::GetStockObject(BLACK_BRUSH);
			break;
		case IDC_RYEDIT2:
			if (IfMoveInPlace[1] == 0) { pDC->SetTextColor(RGB(255, 255, 0)); }
			else if (IfMoveInPlace[1] == 1) { pDC->SetTextColor(RGB(0, 255, 0)); }
			pDC->SetBkColor(RGB(255, 0, 0));
			pDC->SetBkMode(TRANSPARENT);
			return (HBRUSH)::GetStockObject(BLACK_BRUSH);
			break;
		case IDC_RZEDIT2:
			if (IfMoveInPlace[2] == 0) { pDC->SetTextColor(RGB(255, 255, 0)); }
			else if (IfMoveInPlace[2] == 1) { pDC->SetTextColor(RGB(0, 255, 0)); }
			pDC->SetBkColor(RGB(255, 0, 0));
			pDC->SetBkMode(TRANSPARENT);
			return (HBRUSH)::GetStockObject(BLACK_BRUSH);
			break;
		case IDC_RAXEDIT2:
			if (IfMoveInPlace[3] == 0) { pDC->SetTextColor(RGB(255, 255, 0)); }
			else if (IfMoveInPlace[3] == 1) { pDC->SetTextColor(RGB(0, 255, 0)); }
			pDC->SetBkColor(RGB(255, 0, 0));
			pDC->SetBkMode(TRANSPARENT);
			return (HBRUSH)::GetStockObject(BLACK_BRUSH);
			break;
		case IDC_RAYEDIT2:
			if (IfMoveInPlace[4] == 0) { pDC->SetTextColor(RGB(255, 255, 0)); }
			else if (IfMoveInPlace[4] == 1) { pDC->SetTextColor(RGB(0, 255, 0)); }
			pDC->SetBkColor(RGB(255, 0, 0));
			pDC->SetBkMode(TRANSPARENT);
			return (HBRUSH)::GetStockObject(BLACK_BRUSH);
			break;
		case IDC_RAZEDIT2:
			if (IfMoveInPlace[5] == 0) { pDC->SetTextColor(RGB(255, 255, 0)); }
			else if (IfMoveInPlace[5] == 1) { pDC->SetTextColor(RGB(0, 255, 0)); }
			pDC->SetBkColor(RGB(255, 0, 0));
			pDC->SetBkMode(TRANSPARENT);
			return (HBRUSH)::GetStockObject(BLACK_BRUSH);
			break;
		default:
			break;
		}
	}
	// TODO:  如果默认的不是所需画笔，则返回另一个画笔
	return hbr;
}


void CMainUI::OnStnClickedPlanchoice()
{
	int nonullstr=0;
	m_plancombobox.GetWindowText(m_report.PlanName);
	if (m_report.PlanName=="")
	{
		return;
	}
	mysql_init(&m_sqlCon);//初始化数据库对象
	if (!mysql_real_connect(&m_sqlCon, "localhost", "root", "123456", "chair001", 3306, NULL, 0))//localhost:服务器地址，可以直接填入IP;root:账号;123:密码;test:数据库名;3306:网络端口  
	{
		AfxMessageBox(_T("数据库连接失败!"));
		return;
	}
	else//连接成功则继续访问数据库，之后的相关操作代码基本是放在这里面的
	{
		str.Format(L"SELECT beam1,beam2,beam3,beam4,beam5,beam6,beam7,beam8,beam9,beam10 FROM plan where name = \"%s%s\"", m_report.PatientID, m_report.PlanName);

		const wchar_t* wstr = (LPCTSTR)str;         //一定得是unicode，否则这句话会错的
		char c1[500] = { 0 };
		wcstombs(c1, wstr, wcslen(wstr));
		//最后进行转换
		const char* cc1 = c1;

		mysql_query(&m_sqlCon, cc1);//从users这个表格查询密码"SELECT password FROM users where id = 1000"
									//获取结果集
		m_res = mysql_store_result(&m_sqlCon);
		m_row2 = mysql_fetch_row(m_res);
		
