AlanYANG0916/RCTSV0.2.1/STC1/MainUI.cpp
		for (size_t i = 0; i < 10; i++)
		{
			m_report.BeamAngle[i] = m_row2[i];
			nonullstr = i;
			if ( m_report.BeamAngle[i] == "")
			{			
				break;
			}
		}

		str.Format(L"SELECT beam1,beam2,beam3,beam4,beam5,beam6,beam7,beam8,beam9,beam10 FROM plan where name = \"%s%sN\"", m_report.PatientID,m_report.PlanName);

		wstr = (LPCTSTR)str;         //一定得是unicode，否则这句话会错的
		for (int i = 0; i < 500; i++) { c1[i] = 0; }
		wcstombs(c1, wstr, wcslen(wstr));
		//最后进行转换
		cc1 = c1;

		mysql_query(&m_sqlCon, cc1);//从users这个表格查询密码"SELECT password FROM users where id = 1000"
									//获取结果集
		m_res = mysql_store_result(&m_sqlCon);
		m_row2 = mysql_fetch_row(m_res);

		for (size_t i = 0; i < 10; i++)
		{
			m_report.BeamName[i] = m_row2[i];
			nonullstr = i;
			if (m_report.BeamName[i] == "")
			{
				break;
			}
		}
		mysql_close(&m_sqlCon);//关闭Mysql连接
	}	
	if (isfirstshowbeam)
	{
		isfirstshowbeam = false;
		CRect rect; 
		m_beamlist.GetClientRect(&rect);
		m_beamlist.InsertColumn(0, _T("BeamName"), LVCFMT_CENTER, rect.Width() / 3 * 2);
		m_beamlist.InsertColumn(1, _T("ISO/°"), LVCFMT_CENTER, rect.Width() / 3);
	}
	m_beamlist.DeleteAllItems();
	for (size_t i = 0; i < nonullstr; i++)
	{
		m_beamlist.InsertItem(i, m_report.BeamName[i]);
		m_beamlist.SetItemText(i, 1, m_report.BeamAngle[i]);
	}
	HICON m_hIcon = AfxGetApp()->LoadIcon(IDI_ICON8);
	((CStatic*)GetDlgItem(IDC_PLANChoice))->SetIcon(m_hIcon);
}


void CMainUI::OnNMDblclkCommlist(NMHDR *pNMHDR, LRESULT *pResult)
{
	LPNMITEMACTIVATE pNMItemActivate = reinterpret_cast<LPNMITEMACTIVATE>(pNMHDR);
	// TODO: 在此添加控件通知处理程序代码
	POSITION pos = m_beamlist.GetFirstSelectedItemPosition();
	int nItem = m_beamlist.GetNextSelectedItem(pos);
	m_beamlist.SetItemData(nItem, COLOR_YELLOW);
	str=m_beamlist.GetItemText(nItem, 1);
	SetDlgItemText(IDC_360EDIT2, str);

	str = m_beamlist.GetItemText(nItem, 0);
	m_report.BeamName[m_report.BeamNum]=str;

	*pResult = 0;
}


void CMainUI::OnCbnSelchangePlancombo()
{
	HICON m_hIcon = AfxGetApp()->LoadIcon(IDI_ICON9);
	((CStatic*)GetDlgItem(IDC_PLANChoice))->SetIcon(m_hIcon);
}

void CMainUI::OnBnClickedButton1()
{
	CString sr;
	mysql_init(&m_sqlCon);//初始化数据库对象
	if (!mysql_real_connect(&m_sqlCon, "localhost", "root", "123456", "chair001", 3306, NULL, 0))//localhost:服务器地址，可以直接填入IP;root:账号;123:密码;test:数据库名;3306:网络端口  
	{
		AfxMessageBox(_T("数据库连接失败!"));
		return;
	}
	else//连接成功则继续访问数据库，之后的相关操作代码基本是放在这里面的
	{
	}
	UpdateData(TRUE);
	mysql_query(&m_sqlCon, "SELECT id FROM user2");//从user2这个表格查询id
	//获取结果集
	m_res = mysql_store_result(&m_sqlCon);

	//int i = 0;
	int id = 0;
	while (m_row = mysql_fetch_row(m_res))
	{
		for (size_t i = 0; i < 10000; i++)
		{
			str = m_row[0];
			if (i == _wtof(str.GetBuffer()))
			{
				sr.Format(L"%d", i);
				str.Format(L"UPDATE user2 SET password=AES_ENCRYPT(\"%s\", 'scuyf130916') where id = %d", sr, i);
				const wchar_t* wstr = (LPCTSTR)str;         //一定得是unicode，否则这句话会错的
				char c1[500] = { 0 };
				wcstombs(c1, wstr, wcslen(wstr));
				const char* cc1 = c1;
				mysql_query(&m_sqlCon, cc1);
			}
		}

	}
	AfxMessageBox(_T("完成!"));
	mysql_close(&m_sqlCon);//关闭Mysql连接
}


void CMainUI::OnStnClickedStaticpexit()
{
	if (!PisOpen)
	{
		if (ChairMode==1)
		{
			AfxMessageBox(_T("In treatflow can't change patient "));
			return;
		}
		CString result;
		PatientExist = false;
		mysql_init(&m_sqlCon);//初始化数据库对象
		if (!mysql_real_connect(&m_sqlCon, "localhost", "root", "123456", "chair001", 3306, NULL, 0))//localhost:服务器地址，可以直接填入IP;root:账号;123:密码;test:数据库名;3306:网络端口  
		{
			AfxMessageBox(_T("Database connection failed!"));
			return;
		}
		else//连接成功则继续访问数据库，之后的相关操作代码基本是放在这里面的
		{
			//AfxMessageBox(_T("数据库连接成功!"));
		}

		GetDlgItemText(IDC_patientIDEDIT, m_report.PatientID);
		//UpdateData(TRUE);
		//查询数据
		(mysql_query(&m_sqlCon, "SELECT id FROM patient"));//从users这个表格查询id
		m_res = mysql_store_result(&m_sqlCon);
		while (m_row = mysql_fetch_row(m_res))
		{
			str = m_row[0];
			if (_wtof(m_report.PatientID.GetBuffer()) == _wtof(str.GetBuffer()))
			{
				PatientExist = true;
			}

		}
		if (!PatientExist)
		{
			AfxMessageBox(_T("There is no information about the patient!"));
			return;
		}

		//str.Format(L"SELECT beam1 FROM plan where name = %s", "plan001");
		str.Format(L"SELECT PatientName,birth,sex,plan1,plan2,plan3,plan4,plan5,plan6,plan7,plan8,plan9,plan10 FROM patient where id = \"%s\"", m_report.PatientID);

		const wchar_t* wstr = (LPCTSTR)str;         //一定得是unicode，否则这句话会错的
		char c1[500] = { 0 };
		wcstombs(c1, wstr, wcslen(wstr));
		//最后进行转换
		const char* cc1 = c1;

		if (PatientExist)
		{
			mysql_query(&m_sqlCon, cc1);//从users这个表格查询密码"SELECT password FROM users where id = 1000"								//获取结果集
			m_res = mysql_store_result(&m_sqlCon);
			while (m_row = mysql_fetch_row(m_res))
			{
				m_report.PatientName = m_row[0]; str.Format(L"%s%s", L"PatientName:  ", m_report.PatientName); SetDlgItemText(IDC_patientname, str);
				SetDlgItemText(IDC_patientid, L"PatientID:  " + m_report.PatientID);
				m_report.PatientBirth = m_row[1]; str.Format(L"%s%s", L"PatientBirth:  ", m_report.PatientBirth); SetDlgItemText(IDC_patientbirth, str);
				m_report.PatientGender = m_row[2]; str.Format(L"%s%s", L"PatientGender:  ", m_report.PatientGender); SetDlgItemText(IDC_patientsex, str);

				m_plancombobox.ResetContent();
				//m_report.PlanName = m_row[3];
				for (size_t i = 0; i < 10; i++)
				{
					result = m_row[3+i]; 
					//result.Mid(m_report.PatientID.GetLength(),result.GetLength());
					if(result!="")
					{
						m_plancombobox.AddString(result);
					}
					else if (result == "")
					{
						break;
					}
						
				}
			}
		}
		mysql_close(&m_sqlCon);//关闭Mysql连接
		m_beamlist.DeleteAllItems();
		//this->GetDlgItem(IDC_BUTTON11)->EnableWindow(FALSE);
		HICON m_hIcon = AfxGetApp()->LoadIcon(IDI_ICONNO);
		((CStatic*)GetDlgItem(IDC_STATICPExit))->SetIcon(m_hIcon);
		
		PisOpen = true;
		PID = m_report.PatientID;
		this->GetDlgItem(IDC_patientIDEDIT)->EnableWindow(FALSE);

		
	}
	else//关闭病人
	{
		if (IDYES == MessageBox(_T("Close the current patient?"), _T("Notice"), MB_YESNO))
		{
			PisOpen = false;
			SetDlgItemText(IDC_patientname, L"PatientName:");
			SetDlgItemText(IDC_patientid, L"PatientID:  ");
			SetDlgItemText(IDC_patientbirth, L"PatientBirth:  ");
			SetDlgItemText(IDC_patientsex, L"PatientGender:  ");
			m_beamlist.DeleteAllItems();
			m_plancombobox.ResetContent();
			HICON m_hIcon = AfxGetApp()->LoadIcon(IDI_ICONYES);
			((CStatic*)GetDlgItem(IDC_STATICPExit))->SetIcon(m_hIcon);
			m_hIcon = AfxGetApp()->LoadIcon(IDI_ICON9);
			((CStatic*)GetDlgItem(IDC_PLANChoice))->SetIcon(m_hIcon);
			PID = L"Patient ID";
			SetDlgItemTextW(IDC_patientIDEDIT, PID);
			this->GetDlgItem(IDC_patientIDEDIT)->EnableWindow(TRUE);
			this->GetDlgItem(IDC_TREATMODEBUTTON)->EnableWindow(FALSE);
		}
	}
	
}


void CMainUI::OnNMCustomdrawCommlist(NMHDR *pNMHDR, LRESULT *pResult)
{
	LPNMTVCUSTOMDRAW pNMCD = reinterpret_cast<LPNMTVCUSTOMDRAW>(pNMHDR);
	// TODO: 在此添加控件通知处理程序代码  
	NMCUSTOMDRAW nmCustomDraw = pNMCD->nmcd;
	switch (nmCustomDraw.dwDrawStage)
	{
	case CDDS_ITEMPREPAINT:
	{
		if (COLOR_BLUE == nmCustomDraw.lItemlParam)
		{
			pNMCD->clrTextBk = RGB(51, 153, 255);
			pNMCD->clrText = RGB(255, 255, 255);
		}
		else if (COLOR_YELLOW == nmCustomDraw.lItemlParam)
		{
			pNMCD->clrTextBk = RGB(51, 153, 255);      //背景颜色  
			pNMCD->clrText = RGB(255, 255, 255);     //文字颜色  
		}
		else if (COLOR_DEFAULT == nmCustomDraw.lItemlParam)
		{
			pNMCD->clrTextBk = RGB(255, 255, 255);
			pNMCD->clrText = RGB(0, 0, 0);
		}
		else
		{
			//  
		}
		break;
	}
	default:
	{
		break;
	}
	}

	*pResult = 0;
	*pResult |= CDRF_NOTIFYPOSTPAINT;       //必须有，不然就没有效果  
	*pResult |= CDRF_NOTIFYITEMDRAW;        //必须有，不然就没有效果  
	return;
}

void CMainUI::OnCancel()
{
}


void CMainUI::OnBnClickedButton3()
{
	// TODO: 在此添加控件通知处理程序代码
	str = "http://www.baidu.com";
	if(GetHttpCode(str))
	{
		LinkToESB();
	}
	
}
